{
  "sun": {
    "name": "Sun",
    "symbol": "☉",
    "properties": "Star at the center of our Solar System",
    "keywords": [
      "Identity",
      "Vitality",
      "Ego",
      "Life Force",
      "Purpose",
      "Father"
    ],
    "rules": ["Leo"],
    "exalted": "Aries",
    "detriment": "Aquarius",
    "fall": "Libra",
    "mysticalProperties": "Represents the self, individuality, and spirit. Symbolizes power, vitality, and the essence of being.",
    "retrogradeEffect": "The Sun does not go retrograde. Its energy is constant, representing the unwavering core of self that anchors all other planetary influences.",
    "transitEffect": "Sun transits illuminate the house it passes through, bringing focus, vitality, and attention to those life areas. Annual Sun return marks your birthday—a time of renewal.",
    "houseMeaning": "The Sun in your natal chart shows where you shine brightest, where your ego finds expression, and where you seek recognition and purpose.",
    "affirmation": "I shine with my authentic self and embrace my vital life force."
  },
  "moon": {
    "name": "Moon",
    "symbol": "☽",
    "properties": "Earth's only natural satellite",
    "keywords": [
      "Emotions",
      "Instincts",
      "Nurturing",
      "Subconscious",
      "Mother",
      "Habits"
    ],
    "rules": ["Cancer"],
    "exalted": "Taurus",
    "detriment": "Capricorn",
    "fall": "Scorpio",
    "mysticalProperties": "Controls emotions, moods, and the unconscious. It influences intuition, psychic abilities, and emotional well-being.",
    "retrogradeEffect": "The Moon does not go retrograde in the traditional sense. Its phases (New, Waxing, Full, Waning) create the lunar cycle that influences emotional tides and intuition.",
    "transitEffect": "Moon transits change every 2.5 days, influencing daily moods and emotional responses. Track the Moon through your chart to understand your emotional rhythms.",
    "houseMeaning": "The Moon in your natal chart reveals your emotional nature, how you nurture and need to be nurtured, and your deepest unconscious patterns.",
    "affirmation": "I honor my emotions and trust my intuitive wisdom."
  },
  "mercury": {
    "name": "Mercury",
    "symbol": "☿",
    "properties": "Smallest and closest to the Sun",
    "keywords": [
      "Communication",
      "Intellect",
      "Learning",
      "Travel",
      "Writing",
      "Logic"
    ],
    "rules": ["Gemini", "Virgo"],
    "exalted": "Virgo",
    "detriment": "Sagittarius",
    "fall": "Pisces",
    "mysticalProperties": "Governed by communication, intellect, and speed. Often associated with travel, writing, speaking, and all forms of communication.",
    "retrogradeEffect": "Mercury retrograde (3-4 times yearly, ~3 weeks each) affects communication, technology, travel, and contracts. Review, revise, and reflect rather than starting new ventures. Expect delays and miscommunications.",
    "transitEffect": "Mercury transits bring mental focus to the house it visits. Quick-moving Mercury stimulates thinking, communication, and short trips related to that life area.",
    "houseMeaning": "Mercury in your natal chart shows how you think, communicate, and process information. It reveals your learning style and mental approach to life.",
    "affirmation": "I communicate clearly and embrace curiosity in all learning."
  },
  "venus": {
    "name": "Venus",
    "symbol": "♀",
    "properties": "Second planet from the Sun, similar to Earth in size",
    "keywords": ["Love", "Beauty", "Harmony", "Values", "Money", "Pleasure"],
    "rules": ["Taurus", "Libra"],
    "exalted": "Pisces",
    "detriment": "Aries",
    "fall": "Virgo",
    "mysticalProperties": "Rules love, beauty, and finances. It influences personal charm, attractiveness, and personal relationships.",
    "retrogradeEffect": "Venus retrograde (every 18 months, ~40 days) brings review of relationships, values, and finances. Ex-partners may reappear. Avoid major beauty changes or large purchases. Reassess what you truly value.",
    "transitEffect": "Venus transits bring pleasure, beauty, and harmony to the house it visits. Good for social activities, romance, and financial matters in that life area.",
    "houseMeaning": "Venus in your natal chart shows how you love, what you find beautiful, and your approach to pleasure and money. It reveals your romantic style.",
    "affirmation": "I attract love and beauty by honoring my values."
  },
  "earth": {
    "name": "Earth",
    "symbol": "⊕",
    "properties": "Third planet from the Sun, our home planet",
    "keywords": [
      "Grounding",
      "Manifestation",
      "Physical",
      "Material",
      "Fertility",
      "Life"
    ],
    "rules": [],
    "mysticalProperties": "Symbolizes grounding, fertility, and life. In astrology, it is often related to practicality and materialism.",
    "retrogradeEffect": "Earth does not go retrograde from our perspective. It represents our grounded, physical experience from which we observe all other planetary movements.",
    "transitEffect": "Earth is not used in traditional transit analysis, though some modern astrologers use the Earth's position opposite the Sun (heliocentric) for grounding insights.",
    "houseMeaning": "Earth is our vantage point for the entire natal chart. Some modern systems place Earth opposite the Sun to understand material and physical grounding.",
    "affirmation": "I am grounded in my physical body and connected to the Earth."
  },
  "mars": {
    "name": "Mars",
    "symbol": "♂",
    "properties": "Fourth planet from the Sun, known for its red appearance",
    "keywords": [
      "Action",
      "Passion",
      "Drive",
      "Aggression",
      "Courage",
      "Desire"
    ],
    "rules": ["Aries", "Scorpio (traditional)"],
    "exalted": "Capricorn",
    "detriment": "Libra",
    "fall": "Cancer",
    "mysticalProperties": "Associated with energy, passion, and war. Influences desire, aggression, and determination.",
    "retrogradeEffect": "Mars retrograde (every 2 years, ~2 months) redirects energy inward. Physical vitality may decrease. Avoid starting fights or major initiatives. Review how you assert yourself and handle conflict.",
    "transitEffect": "Mars transits bring energy, drive, and sometimes conflict to the house it visits. Good for taking action, but watch for aggression. Activities requiring courage are favored.",
    "houseMeaning": "Mars in your natal chart shows how you take action, assert yourself, and express desire and anger. It reveals your fighting style and energy direction.",
    "affirmation": "I channel my passion into courageous, purposeful action."
  },
  "jupiter": {
    "name": "Jupiter",
    "symbol": "♃",
    "properties": "Largest planet in the Solar System",
    "keywords": [
      "Expansion",
      "Luck",
      "Wisdom",
      "Growth",
      "Abundance",
      "Philosophy"
    ],
    "rules": ["Sagittarius", "Pisces (traditional)"],
    "exalted": "Cancer",
    "detriment": "Gemini",
    "fall": "Capricorn",
    "mysticalProperties": "Symbolizes growth, expansion, and abundance. Known for bringing luck and wealth.",
    "retrogradeEffect": "Jupiter retrograde (4 months yearly) turns expansion inward. Philosophical and spiritual growth emphasized over material. Reassess beliefs and where you seek meaning. Inner wisdom develops.",
    "transitEffect": "Jupiter transits bring luck, expansion, and opportunity to the house it visits (~1 year per sign). Excellent for growth, travel, and taking risks in that life area.",
    "houseMeaning": "Jupiter in your natal chart shows where you find luck, seek expansion, and experience abundance. It reveals your approach to faith and higher learning.",
    "affirmation": "I embrace growth and trust in life's abundant opportunities."
  },
  "saturn": {
    "name": "Saturn",
    "symbol": "♄",
    "properties": "Known for its extensive ring system",
    "keywords": [
      "Discipline",
      "Structure",
      "Karma",
      "Lessons",
      "Time",
      "Responsibility"
    ],
    "rules": ["Capricorn", "Aquarius (traditional)"],
    "exalted": "Libra",
    "detriment": "Cancer",
    "fall": "Aries",
    "mysticalProperties": "Represents discipline, responsibility, and restrictions. Teaches lessons about patience and diligence.",
    "retrogradeEffect": "Saturn retrograde (4.5 months yearly) intensifies internal karmic review. Lessons feel more personal. Review structures and responsibilities. Past issues resurface for resolution.",
    "transitEffect": "Saturn transits bring tests, structure, and maturation to the house it visits (~2.5 years per sign). Challenges lead to mastery. Saturn Return (ages 28-30, 57-60) is major life milestone.",
    "houseMeaning": "Saturn in your natal chart shows where you face challenges, develop discipline, and ultimately achieve mastery. It reveals your karmic lessons.",
    "affirmation": "I embrace life's lessons and build lasting foundations through discipline."
  },
  "uranus": {
    "name": "Uranus",
    "symbol": "♅",
    "properties": "Ice giant with a tilted rotational axis",
    "keywords": [
      "Revolution",
      "Innovation",
      "Freedom",
      "Awakening",
      "Rebellion",
      "Technology"
    ],
    "rules": ["Aquarius"],
    "exalted": "Scorpio",
    "detriment": "Leo",
    "fall": "Taurus",
    "mysticalProperties": "Associated with change, innovation, and disruption. Represents sudden shifts and revolutions.",
    "retrogradeEffect": "Uranus retrograde (5 months yearly) internalizes revolution. Personal rather than external awakening. Review where you need more freedom and authenticity. Inner rebellion processes.",
    "transitEffect": "Uranus transits bring sudden change, liberation, and innovation to the house it visits (~7 years per sign). Expect the unexpected. Old structures shatter to make way for new.",
    "houseMeaning": "Uranus in your natal chart shows where you seek freedom, express uniqueness, and experience sudden changes. It reveals your revolutionary spirit.",
    "affirmation": "I embrace change and express my authentic, innovative self."
  },
  "neptune": {
    "name": "Neptune",
    "symbol": "♆",
    "properties": "Ice giant, similar to Uranus, known for its blue color",
    "keywords": [
      "Dreams",
      "Spirituality",
      "Illusion",
      "Compassion",
      "Intuition",
      "Transcendence"
    ],
    "rules": ["Pisces"],
    "exalted": "Cancer",
    "detriment": "Virgo",
    "fall": "Capricorn",
    "mysticalProperties": "Rules dreams, imagination, and the subconscious. Linked to spirituality and intuition.",
    "retrogradeEffect": "Neptune retrograde (5 months yearly) lifts veils of illusion. Spiritual insights deepen but confusion may clear. Dreams become more significant. Inner spiritual work emphasized.",
    "transitEffect": "Neptune transits dissolve boundaries and bring spiritual awareness to the house it visits (~14 years per sign). Watch for confusion and escapism alongside inspiration.",
    "houseMeaning": "Neptune in your natal chart shows where you seek transcendence, experience intuition, and may encounter illusion. It reveals your spiritual nature.",
    "affirmation": "I trust my intuition and embrace spiritual connection."
  },
  "pluto": {
    "name": "Pluto",
    "symbol": "♇",
    "properties": "Dwarf planet, known for its elliptical orbit",
    "keywords": [
      "Transformation",
      "Power",
      "Death/Rebirth",
      "Shadow",
      "Intensity",
      "Regeneration"
    ],
    "rules": ["Scorpio"],
    "exalted": "Aries",
    "detriment": "Taurus",
    "fall": "Libra",
    "mysticalProperties": "Though reclassified, still considered powerful in astrology. Represents transformation, power, and rebirth.",
    "retrogradeEffect": "Pluto retrograde (5-6 months yearly) intensifies internal transformation. Shadow work deepens. Power dynamics become internal. Deep psychological processing occurs.",
    "transitEffect": "Pluto transits bring profound transformation to the house it visits (~12-31 years per sign). Complete destruction and rebirth of that life area. Nothing is left unchanged.",
    "houseMeaning": "Pluto in your natal chart shows where you experience transformation, encounter power dynamics, and face your shadow. It reveals your regenerative power.",
    "affirmation": "I embrace transformation and reclaim my authentic power."
  }
}
