{
  "fehu": {
    "name": "Fehu",
    "meaning": "Cattle, Wealth",
    "symbol": "ᚠ",
    "pronunciation": "FAY-hoo",
    "element": "Fire",
    "deity": "Freya, Frey",
    "aett": "Freya",
    "aettPosition": 1,
    "keywords": [
      "Wealth",
      "Abundance",
      "Success",
      "New Beginnings",
      "Prosperity",
      "Mobile Power"
    ],
    "magicalProperties": "Wealth, prosperity, financial strength",
    "notes": "Used in spells for wealth, abundance, and success. Represents mobile power and new beginnings.",
    "uprightMeaning": "Fehu upright indicates material wealth, financial gain, and abundance flowing into your life. This rune signifies earned success through hard work and proper stewardship of resources. It represents not just money, but all forms of movable wealth—skills, knowledge, and opportunities. Fehu brings the energy of new beginnings and the initial spark needed to start ventures.",
    "reversedMeaning": "Fehu reversed warns of financial loss, greed, or squandered resources. You may be experiencing setbacks due to poor money management or placing too much value on material possessions. It can indicate failed ventures, theft of energy or resources, or the inability to appreciate what you have.",
    "divinationMeaning": "In readings, Fehu suggests financial improvement, successful business dealings, and the acquisition of material goods. It advises wise investment and proper care of resources. New opportunities for wealth creation are emerging.",
    "magicalUses": [
      "Attracting wealth and prosperity",
      "Enhancing business success",
      "Starting new ventures",
      "Increasing personal power",
      "Drawing opportunities"
    ],
    "history": "Fehu is the first rune of the Elder Futhark and represents cattle, which was the primary measure of wealth in ancient Germanic societies. The rune embodies the concept of mobile, transferable wealth and the responsibility that comes with prosperity.",
    "affirmation": "I attract abundance and use my wealth wisely for growth and generosity."
  },
  "uruz": {
    "name": "Uruz",
    "meaning": "Aurochs, Wild Ox",
    "symbol": "ᚢ",
    "pronunciation": "OO-rooz",
    "element": "Earth",
    "deity": "Thor",
    "aett": "Freya",
    "aettPosition": 2,
    "keywords": [
      "Strength",
      "Vitality",
      "Health",
      "Courage",
      "Endurance",
      "Primal Power"
    ],
    "magicalProperties": "Strength, raw energy, vitality",
    "notes": "Empowers rituals for health and vitality, signifies overcoming challenges through strength and perseverance.",
    "uprightMeaning": "Uruz upright represents raw, untamed power and primal life force. It indicates physical strength, good health, and the vitality to overcome obstacles. This rune brings courage to face challenges and the endurance to see them through. It signifies personal transformation through trials and the manifestation of inner strength.",
    "reversedMeaning": "Uruz reversed indicates weakness, illness, or misdirected power. You may be experiencing low energy, poor health, or feeling overwhelmed by circumstances. It warns against brutishness, using strength without wisdom, or being dominated by others.",
    "divinationMeaning": "In readings, Uruz suggests a time of testing that will ultimately strengthen you. It indicates recovery from illness, physical improvement, and the power to shape your circumstances. Trust in your inner strength.",
    "magicalUses": [
      "Healing and health restoration",
      "Building physical strength",
      "Overcoming obstacles",
      "Initiating transformation",
      "Grounding and stability"
    ],
    "history": "The aurochs was a massive wild ox that roamed ancient Europe, symbolizing untamed power and primal force. Now extinct, this animal represented the ultimate test of courage for hunters and warriors, making Uruz a rune of strength through challenge.",
    "affirmation": "I embody primal strength and transform challenges into personal power."
  },
  "thurisaz": {
    "name": "Thurisaz",
    "meaning": "Giant, Thorn",
    "symbol": "ᚦ",
    "pronunciation": "THOOR-ee-sahz",
    "element": "Fire",
    "deity": "Thor",
    "aett": "Freya",
    "aettPosition": 3,
    "keywords": [
      "Protection",
      "Defense",
      "Conflict",
      "Catalyst",
      "Boundaries",
      "Reactive Force"
    ],
    "magicalProperties": "Defense, reactive force, protection",
    "notes": "Protective, used to ward off attacks and enforce spiritual boundaries. Represents defensive force.",
    "uprightMeaning": "Thurisaz upright represents powerful protective energy and the force of Thor. It indicates a time to set strong boundaries, defend your position, and confront obstacles head-on. This rune brings the catalyst energy needed for breakthrough, though it may manifest through conflict or disruption.",
    "reversedMeaning": "Thurisaz reversed warns of defenselessness, danger, or aggression turned inward. You may be vulnerable to attack, experiencing self-sabotage, or using force inappropriately. It can indicate stubbornness, harmful resistance to change, or being the source of conflict.",
    "divinationMeaning": "In readings, Thurisaz suggests a need for protection and careful decision-making. Challenges approach that require defensive action. Wait, observe, and strike only when necessary. Sometimes the best defense is a strategic pause.",
    "magicalUses": [
      "Protection spells and wards",
      "Breaking through obstacles",
      "Defending against enemies",
      "Enforcing boundaries",
      "Catalyzing necessary change"
    ],
    "history": "Thurisaz represents the giants (Thursar) of Norse mythology and Thor's hammer, Mjolnir. This rune embodies the protective and destructive forces of thunder, representing both the danger of chaos and the power to destroy harmful influences.",
    "affirmation": "I am protected by powerful forces and set strong boundaries with wisdom."
  },
  "ansuz": {
    "name": "Ansuz",
    "meaning": "Aesir God, Divine Breath",
    "symbol": "ᚨ",
    "pronunciation": "AHN-sooz",
    "element": "Air",
    "deity": "Odin",
    "aett": "Freya",
    "aettPosition": 4,
    "keywords": [
      "Communication",
      "Wisdom",
      "Divine Message",
      "Inspiration",
      "Knowledge",
      "Speech"
    ],
    "magicalProperties": "Communication, divine message, wisdom",
    "notes": "Associated with wisdom and messages. Used in divination and matters requiring insight.",
    "uprightMeaning": "Ansuz upright represents divine communication, wisdom, and inspired speech. It indicates messages from the gods or higher self, intellectual insight, and the power of words. This rune brings eloquence, successful communication, and the reception of vital knowledge or guidance.",
    "reversedMeaning": "Ansuz reversed warns of miscommunication, manipulation through words, or blocked inspiration. You may be receiving false information, speaking unwisely, or failing to listen to divine guidance. It can indicate confusion, learning difficulties, or elder wisdom being ignored.",
    "divinationMeaning": "In readings, Ansuz suggests important communication is coming—listen carefully for signs, messages, and advice from wise sources. It favors examinations, speeches, negotiations, and any matter involving words or knowledge.",
    "magicalUses": [
      "Enhancing communication skills",
      "Receiving divine guidance",
      "Passing examinations",
      "Successful negotiations",
      "Connecting with Odin or ancestral wisdom"
    ],
    "history": "Ansuz is Odin's rune, representing the divine breath he gave to humanity and the wisdom he gained from sacrificing himself on Yggdrasil. The rune embodies the power of communication, poetry, and the transmission of sacred knowledge.",
    "affirmation": "I receive and share divine wisdom through clear, inspired communication."
  },
  "raidho": {
    "name": "Raidho",
    "meaning": "Ride, Journey",
    "symbol": "ᚱ",
    "pronunciation": "RYE-tho",
    "element": "Air",
    "deity": "Thor, Nerthus",
    "aett": "Freya",
    "aettPosition": 5,
    "keywords": [
      "Journey",
      "Travel",
      "Rhythm",
      "Right Action",
      "Movement",
      "Order"
    ],
    "magicalProperties": "Travel, movement, correct action",
    "notes": "Used in spells for safe travel, seeing the right path, and personal rhythm.",
    "uprightMeaning": "Raidho upright represents travel, both physical and spiritual, and finding the right path forward. It indicates proper order, natural rhythm, and the flow of life moving in the right direction. This rune brings safe journeys, rational decision-making, and alignment with cosmic order.",
    "reversedMeaning": "Raidho reversed warns of disrupted journeys, wrong directions, or being out of sync with natural rhythms. Travel plans may go awry, or you may be forcing movement when stillness is needed. It can indicate injustice, irrationality, or loss of direction.",
    "divinationMeaning": "In readings, Raidho suggests movement is favorable—physical travel, spiritual journey, or life transitions. Follow the natural flow, trust the process, and maintain rhythm in your activities. The path will reveal itself through motion.",
    "magicalUses": [
      "Safe travel protection",
      "Finding the right path",
      "Restoring natural rhythm",
      "Legal matters and justice",
      "Spiritual journeying"
    ],
    "history": "Raidho represents the wagon or chariot used in ritual processions and the cosmic order of the heavens. In Norse tradition, the sun was pulled across the sky by horses, making this rune connected to the great journey of life and the proper order of all things.",
    "affirmation": "I move through life in harmony with natural rhythms and right action."
  },
  "kenaz": {
    "name": "Kenaz",
    "meaning": "Torch, Fire",
    "symbol": "ᚲ",
    "pronunciation": "KAY-nahz",
    "element": "Fire",
    "deity": "Freya, Heimdall",
    "aett": "Freya",
    "aettPosition": 6,
    "keywords": [
      "Illumination",
      "Knowledge",
      "Creativity",
      "Transformation",
      "Passion",
      "Revelation"
    ],
    "magicalProperties": "Revelation, knowledge, creative fire",
    "notes": "Lights up the dark, reveals secrets, enhances learning and understanding.",
    "uprightMeaning": "Kenaz upright represents the torch that illuminates darkness, bringing knowledge, creativity, and understanding. It indicates learning, artistic inspiration, and the fire of passion that transforms. This rune brings clarity to confusion, reveals hidden truths, and ignites creative power.",
    "reversedMeaning": "Kenaz reversed indicates darkness, ignorance, or blocked creativity. Knowledge may be hidden or inaccessible, creative fires may be dampened, or false light may be misleading you. It can warn of illness, loss of passion, or relationships growing cold.",
    "divinationMeaning": "In readings, Kenaz suggests a time of learning, creativity, and revelation. Secrets come to light, skills develop, and passion ignites. It favors study, artistic pursuits, and matters requiring insight or technical skill.",
    "magicalUses": [
      "Enhancing creativity and art",
      "Revealing hidden knowledge",
      "Healing through fire",
      "Igniting passion and desire",
      "Illuminating the path forward"
    ],
    "history": "Kenaz represents the controlled fire of the torch or forge, the creative fire that transforms raw materials into crafted works. Unlike wild fire, Kenaz is the fire of civilization—light in darkness, warmth in cold, and the power to shape the world.",
    "affirmation": "I carry the torch of knowledge and creativity, illuminating my path."
  },
  "gebo": {
    "name": "Gebo",
    "meaning": "Gift",
    "symbol": "ᚷ",
    "pronunciation": "GAY-boh",
    "element": "Air",
    "deity": "Odin, Gefn",
    "aett": "Freya",
    "aettPosition": 7,
    "keywords": [
      "Gift",
      "Exchange",
      "Partnership",
      "Balance",
      "Generosity",
      "Sacrifice"
    ],
    "magicalProperties": "Generosity, exchange, sacred contract",
    "notes": "Symbolizes gifts and hospitality, represents balance and equality in partnerships.",
    "uprightMeaning": "Gebo represents the sacred exchange of gifts, partnerships, and the balance between giving and receiving. It indicates generosity, hospitality, and the bonds formed through mutual exchange. This rune brings harmonious relationships, successful contracts, and the blessings that come from generosity.",
    "reversedMeaning": "Gebo has no reversed position as the X shape is symmetrical. However, in a challenging context, it may indicate imbalanced exchange, obligation, or gifts with strings attached. Beware of sacrificing too much or unequal partnerships.",
    "divinationMeaning": "In readings, Gebo suggests gifts coming your way, successful partnerships, and balanced exchange. It favors contracts, marriages, business partnerships, and any situation requiring mutual giving. Generosity will be returned.",
    "magicalUses": [
      "Attracting gifts and blessings",
      "Strengthening partnerships",
      "Sealing contracts and agreements",
      "Balancing relationships",
      "Creating sacred bonds"
    ],
    "history": "In Norse culture, gift-giving was a sacred act that created bonds of obligation and loyalty. Gebo embodies this principle of reciprocal exchange, where the giving of gifts creates a sacred contract between parties, binding them together.",
    "affirmation": "I give and receive freely, creating balanced and blessed partnerships."
  },
  "wunjo": {
    "name": "Wunjo",
    "meaning": "Joy",
    "symbol": "ᚹ",
    "pronunciation": "WOON-yo",
    "element": "Earth",
    "deity": "Odin, Frigg",
    "aett": "Freya",
    "aettPosition": 8,
    "keywords": [
      "Joy",
      "Happiness",
      "Harmony",
      "Fellowship",
      "Success",
      "Well-being"
    ],
    "magicalProperties": "Happiness, well-being, harmony",
    "notes": "Used to create happiness and harmony, attracts positive energies.",
    "uprightMeaning": "Wunjo upright represents pure joy, happiness, and the harmony that comes from achieving your desires. It indicates success, recognition, and the pleasure of fellowship with others. This rune brings the satisfaction of goals achieved, peaceful relationships, and genuine contentment.",
    "reversedMeaning": "Wunjo reversed indicates sorrow, alienation, or false happiness. Joy may be blocked or tainted by underlying problems. It can warn of strained relationships, deluded thinking, or the emptiness of superficial pleasure. Depression or isolation may be present.",
    "divinationMeaning": "In readings, Wunjo suggests a time of celebration, success, and happiness. It favors social gatherings, celebrations, and matters of the heart. Good news arrives, harmony prevails, and contentment is achieved.",
    "magicalUses": [
      "Attracting joy and happiness",
      "Creating harmony in groups",
      "Celebrating achievements",
      "Healing depression or sorrow",
      "Binding people in friendship"
    ],
    "history": "Wunjo completes the first aett (group of eight runes), representing the culmination of the first cycle of growth and the joy of achievement. It embodies the Norse concept of well-being that comes from being in right relationship with oneself, community, and the gods.",
    "affirmation": "I embrace joy and harmony in all aspects of my life."
  },
  "hagalaz": {
    "name": "Hagalaz",
    "meaning": "Hail",
    "symbol": "ᚺ",
    "pronunciation": "HAH-gah-lahz",
    "element": "Water/Ice",
    "deity": "Urd, Hel",
    "aett": "Heimdall",
    "aettPosition": 1,
    "keywords": [
      "Disruption",
      "Crisis",
      "Transformation",
      "Uncontrolled Change",
      "Natural Forces",
      "Fate"
    ],
    "magicalProperties": "Disruption, uncontrollable change, transformation",
    "notes": "Represents uncontrollable forces, used for breaking destructive patterns.",
    "uprightMeaning": "Hagalaz represents the uncontrollable forces of nature—hail that destroys crops but also brings water. It indicates sudden disruption, crisis, or events beyond your control. However, within destruction lies the seed of transformation. This rune brings necessary endings that clear the way for new growth.",
    "reversedMeaning": "Hagalaz has no reversed position. In all contexts, it represents forces beyond human control. The difference lies in your response—resistance increases suffering while acceptance allows transformation to unfold.",
    "divinationMeaning": "In readings, Hagalaz warns of sudden disruption or crisis approaching. It counsels acceptance rather than resistance, finding the opportunity within the challenge. What is destroyed makes room for what is needed.",
    "magicalUses": [
      "Breaking destructive patterns",
      "Embracing necessary change",
      "Weather magic",
      "Connecting with fate",
      "Protection through transformation"
    ],
    "history": "Hagalaz begins the second aett, associated with transformation through trial. Hail was particularly destructive to ancient agrarian societies, yet also represented frozen water that would eventually melt and nourish the land—destruction that serves renewal.",
    "affirmation": "I accept uncontrollable change as the catalyst for necessary transformation."
  },
  "nauthiz": {
    "name": "Nauthiz",
    "meaning": "Need, Necessity",
    "symbol": "ᚾ",
    "pronunciation": "NOW-theez",
    "element": "Fire",
    "deity": "Skuld, the Norns",
    "aett": "Heimdall",
    "aettPosition": 2,
    "keywords": [
      "Need",
      "Constraint",
      "Necessity",
      "Hardship",
      "Lesson",
      "Survival"
    ],
    "magicalProperties": "Resistance, constraint, overcoming limitation",
    "notes": "Helps in overcoming limitations, teaches the necessity of facing hardships.",
    "uprightMeaning": "Nauthiz represents need, constraint, and the friction that produces fire. It indicates hardship, limitation, and the necessity of facing difficult circumstances. Yet within constraint lies motivation—need drives innovation and growth. This rune brings the strength to endure and the wisdom gained through struggle.",
    "reversedMeaning": "Nauthiz reversed intensifies constraint, indicating extreme limitation or poverty. You may be fighting against necessary lessons or experiencing the consequences of ignoring genuine needs. Desperation or deprivation may be present.",
    "divinationMeaning": "In readings, Nauthiz suggests a time of need or constraint. Focus on essentials, conserve resources, and learn from limitations. Resistance creates strength. The hardship you face teaches vital lessons.",
    "magicalUses": [
      "Overcoming obstacles",
      "Identifying true needs",
      "Creating fire from friction",
      "Binding and constraining",
      "Survival in hard times"
    ],
    "history": "The fire-bow or \"need-fire\" was created by friction in times of desperate need, symbolizing how necessity drives creation. Nauthiz represents the constraints that paradoxically generate the energy for breakthrough and survival.",
    "affirmation": "I embrace my needs as teachers and find strength within constraint."
  },
  "isa": {
    "name": "Isa",
    "meaning": "Ice",
    "symbol": "ᛁ",
    "pronunciation": "EE-sah",
    "element": "Water/Ice",
    "deity": "Verdandi",
    "aett": "Heimdall",
    "aettPosition": 3,
    "keywords": [
      "Ice",
      "Stillness",
      "Clarity",
      "Concentration",
      "Pause",
      "Ego"
    ],
    "magicalProperties": "Stasis, clarity, concentration",
    "notes": "Used to halt situations or forces, promotes concentration and focus.",
    "uprightMeaning": "Isa represents ice—frozen, still, and crystalline. It indicates a period of stasis, standstill, or necessary pause. Movement is blocked, but clarity is enhanced. This rune brings focus, concentration, and the preservation of what matters while change is suspended.",
    "reversedMeaning": "Isa has no reversed position. In challenging contexts, it may indicate frozen emotions, ego blindness, or paralysis of will. Being stuck can become permanent if consciousness is not maintained.",
    "divinationMeaning": "In readings, Isa suggests a time to pause, wait, and concentrate. Nothing moves forward now—accept the stillness and use it for reflection. Plans are frozen temporarily; patience is required.",
    "magicalUses": [
      "Halting or freezing situations",
      "Enhancing concentration",
      "Cooling anger or passion",
      "Preserving the current state",
      "Developing will and ego strength"
    ],
    "history": "In Norse cosmology, ice was one of the two primordial forces (along with fire) that created the universe. Isa embodies the still, concentrating power of ice—the force that preserves and crystallizes form from chaos.",
    "affirmation": "I embrace stillness and find clarity in the pause."
  },
  "jera": {
    "name": "Jera",
    "meaning": "Year, Harvest",
    "symbol": "ᛃ",
    "pronunciation": "YAIR-ah",
    "element": "Earth",
    "deity": "Freyr, Freyja",
    "aett": "Heimdall",
    "aettPosition": 4,
    "keywords": [
      "Harvest",
      "Cycles",
      "Fruition",
      "Reward",
      "Patience",
      "Natural Time"
    ],
    "magicalProperties": "Fertility, fruition, cycles",
    "notes": "Symbolizes cycles and seasons, used to bring events to completion and fruition.",
    "uprightMeaning": "Jera represents the year, the harvest, and the fulfillment of cycles. It indicates reaping what you have sown—rewards for past efforts. This rune brings completion of projects, natural timing, and the recognition that all things come in their proper season.",
    "reversedMeaning": "Jera has no reversed position as it is symmetrical. However, in challenging contexts, it may indicate poor timing, failed harvests, or impatience with natural cycles. What was planted poorly yields accordingly.",
    "divinationMeaning": "In readings, Jera suggests success through patience and proper timing. The harvest approaches—rewards come for past efforts. Trust natural cycles and maintain steady effort. Completion is near.",
    "magicalUses": [
      "Bringing projects to completion",
      "Fertility and abundance",
      "Aligning with natural cycles",
      "Legal matters (just rewards)",
      "Long-term success"
    ],
    "history": "Jera represents the agricultural year and the harvest that sustained ancient communities. The rune embodies the understanding that right effort at the right time yields abundance—the wisdom of working with, not against, natural cycles.",
    "affirmation": "I trust in divine timing and reap the harvest of my efforts."
  },
  "eihwaz": {
    "name": "Eihwaz",
    "meaning": "Yew Tree",
    "symbol": "ᛇ",
    "pronunciation": "AY-wahz",
    "element": "All Elements",
    "deity": "Odin, Ull",
    "aett": "Heimdall",
    "aettPosition": 5,
    "keywords": [
      "Protection",
      "Endurance",
      "Defense",
      "Transformation",
      "Death/Rebirth",
      "Yggdrasil"
    ],
    "magicalProperties": "Protection, endurance, connection between worlds",
    "notes": "Strengthens personal power, used for protection and invincibility in challenges.",
    "uprightMeaning": "Eihwaz represents the yew tree—evergreen, long-lived, and connected to both death and immortality. It indicates endurance, protection, and the ability to navigate between worlds. This rune brings reliable strength, defense against harm, and transformation through symbolic death and rebirth.",
    "reversedMeaning": "Eihwaz has no reversed position. In challenging contexts, it may indicate fear of change, rigidity, or confusion between levels of reality. The protection may become a prison if misused.",
    "divinationMeaning": "In readings, Eihwaz suggests a time of testing that requires endurance. Protection is available, but transformation is the price. Trust in your ability to survive and emerge changed.",
    "magicalUses": [
      "Powerful protection magic",
      "Journeying between worlds",
      "Shamanic transformation",
      "Enhancing magical endurance",
      "Connecting with Yggdrasil"
    ],
    "history": "The yew tree was sacred across Germanic cultures—simultaneously poisonous and associated with immortality. It connects to Yggdrasil, the World Tree, representing the axis that connects all realms and the shaman's ability to travel between them.",
    "affirmation": "I am protected through all transformations and connected to all realms."
  },
  "perthro": {
    "name": "Perthro",
    "meaning": "Dice Cup, Mystery",
    "symbol": "ᛈ",
    "pronunciation": "PAIR-throw",
    "element": "Water",
    "deity": "Frigg, the Norns",
    "aett": "Heimdall",
    "aettPosition": 6,
    "keywords": [
      "Mystery",
      "Fate",
      "Chance",
      "Secrets",
      "Divination",
      "Feminine Mysteries"
    ],
    "magicalProperties": "Chance, mystery, hidden things",
    "notes": "Linked to fate and prophecy, used in practices involving divination and the understanding of destiny.",
    "uprightMeaning": "Perthro represents the dice cup, the womb, and the mysteries of fate. It indicates hidden knowledge, chance, and the working of wyrd (fate). This rune brings divination ability, revelation of secrets, and understanding of the feminine mysteries of birth and transformation.",
    "reversedMeaning": "Perthro reversed suggests hidden dangers, secrets working against you, or misunderstanding of fate. Addiction, particularly gambling, may be indicated. The future is unclear or deliberately obscured.",
    "divinationMeaning": "In readings, Perthro suggests mysteries are at work. Trust in fate while making wise choices. Secrets may be revealed, or further inquiry is needed. Divination and intuition are enhanced.",
    "magicalUses": [
      "Enhancing divination abilities",
      "Understanding fate and wyrd",
      "Revealing hidden knowledge",
      "Luck and gambling",
      "Feminine mysteries and birth"
    ],
    "history": "Perthro's exact meaning is debated, but it connects to lot-casting, the dice cup used for divination, and the well of Wyrd from which the Norns draw fate. It represents the interplay between chance and destiny that shapes all lives.",
    "affirmation": "I embrace mystery and work in harmony with my fate."
  },
  "algiz": {
    "name": "Algiz",
    "meaning": "Elk, Protection",
    "symbol": "ᛉ",
    "pronunciation": "AHL-geez",
    "element": "Air",
    "deity": "Heimdall, Valkyries",
    "aett": "Heimdall",
    "aettPosition": 7,
    "keywords": [
      "Protection",
      "Defense",
      "Sanctuary",
      "Connection to Divine",
      "Awakening",
      "Higher Self"
    ],
    "magicalProperties": "Protection, defense, spiritual connection",
    "notes": "Strongly protective, wards off negative energies and attacks.",
    "uprightMeaning": "Algiz represents the elk's antlers raised in protection and the connection between human and divine. It indicates powerful protection, sanctuary, and the awakening of spiritual awareness. This rune brings safety from harm, connection to higher powers, and the ability to sense danger before it strikes.",
    "reversedMeaning": "Algiz reversed indicates vulnerability, hidden danger, or blocked spiritual connection. You may be ignoring warning signs, leaving yourself unprotected, or cut off from higher guidance. Danger may come from within.",
    "divinationMeaning": "In readings, Algiz suggests protection is available if you reach for it. Stay alert to danger, trust your instincts, and connect with your spiritual guardians. You are protected when you maintain awareness.",
    "magicalUses": [
      "Creating protective wards",
      "Connecting with spirit guides",
      "Awakening spiritual awareness",
      "Shielding from harm",
      "Enhancing psychic sensitivity"
    ],
    "history": "Algiz represents the elk-sedge (a protective plant) or elk antlers, both defensive symbols. It connects to Heimdall, the watchman of the gods, and the Valkyries who choose and protect the worthy. The shape suggests a person with arms raised in prayer or protection.",
    "affirmation": "I am divinely protected and connected to my higher guidance."
  },
  "sowilo": {
    "name": "Sowilo",
    "meaning": "Sun",
    "symbol": "ᛊ",
    "pronunciation": "SO-wee-lo",
    "element": "Fire",
    "deity": "Sunna/Sol, Baldur",
    "aett": "Heimdall",
    "aettPosition": 8,
    "keywords": [
      "Sun",
      "Success",
      "Victory",
      "Health",
      "Guidance",
      "Enlightenment"
    ],
    "magicalProperties": "Guidance, vitality, success",
    "notes": "Represents success and the power of the sun, brings energy and health.",
    "uprightMeaning": "Sowilo represents the sun in full power—victory, success, and illumination. It indicates triumph over obstacles, excellent health, and the guidance of higher purpose. This rune brings the energy of the sun: vitality, clarity, and the power to achieve your goals.",
    "reversedMeaning": "Sowilo has no reversed position as it is symmetrical. However, in challenging contexts, it may indicate false guidance, ego inflation, or burnout from too much fire energy. Balance solar power with wisdom.",
    "divinationMeaning": "In readings, Sowilo promises success, victory, and achievement. The path is illuminated, health improves, and obstacles melt away. Follow your guiding light with confidence.",
    "magicalUses": [
      "Achieving victory and success",
      "Healing and vitality",
      "Finding guidance and direction",
      "Enhancing willpower",
      "Solar magic and energy work"
    ],
    "history": "Sowilo completes Heimdall's aett with the power of the sun—the ultimate source of light and life. In Norse tradition, the sun goddess Sol drove the sun chariot across the sky, representing the triumph of light over darkness.",
    "affirmation": "I shine with the power of the sun and achieve victory in all endeavors."
  },
  "tiwaz": {
    "name": "Tiwaz",
    "meaning": "Tyr, the God",
    "symbol": "ᛏ",
    "pronunciation": "TEE-wahz",
    "element": "Air",
    "deity": "Tyr",
    "aett": "Tyr",
    "aettPosition": 1,
    "keywords": [
      "Justice",
      "Sacrifice",
      "Victory",
      "Honor",
      "Leadership",
      "Courage"
    ],
    "magicalProperties": "Justice, sacrifice, victory in battle",
    "notes": "Associated with law and order, used in legal matters and for victory in battles.",
    "uprightMeaning": "Tiwaz represents Tyr, the god of justice and war, who sacrificed his hand to bind the wolf Fenrir. It indicates victory through honor, justice in conflict, and the courage to sacrifice for what is right. This rune brings success in competition, fair outcomes, and leadership abilities.",
    "reversedMeaning": "Tiwaz reversed indicates defeat, injustice, or sacrifice that leads nowhere. You may be fighting without honor, losing courage, or facing unfair outcomes. Broken oaths or failed leadership may be indicated.",
    "divinationMeaning": "In readings, Tiwaz suggests victory is possible through honor and right action. Justice will prevail, but sacrifice may be required. Lead with integrity and fight only for worthy causes.",
    "magicalUses": [
      "Victory in competition",
      "Legal success",
      "Leadership enhancement",
      "Courage and will",
      "Justice and fairness"
    ],
    "history": "Tyr was the original sky father god who became the god of war and justice. His sacrifice of his sword hand to bind Fenrir represents the willingness to give everything for what is right. Tiwaz begins the final aett, representing mature spiritual development.",
    "affirmation": "I act with honor and sacrifice for justice, assured of righteous victory."
  },
  "berkano": {
    "name": "Berkano",
    "meaning": "Birch Goddess",
    "symbol": "ᛒ",
    "pronunciation": "BAIR-kah-no",
    "element": "Earth",
    "deity": "Frigg, Berchta",
    "aett": "Tyr",
    "aettPosition": 2,
    "keywords": [
      "Birth",
      "Growth",
      "Fertility",
      "Nurturing",
      "New Beginnings",
      "Healing"
    ],
    "magicalProperties": "Birth, regeneration, nurturing",
    "notes": "Used for new beginnings, nurturing growth, and healing.",
    "uprightMeaning": "Berkano represents the birch tree and the nurturing feminine principle. It indicates birth, new beginnings, and gentle growth. This rune brings fertility, nurturing energy, and the care needed for new projects or relationships to flourish. Healing and regeneration are favored.",
    "reversedMeaning": "Berkano reversed indicates blocked growth, fertility problems, or smothering care. New beginnings may be stunted, nurturing may become controlling, or family issues may arise. Anxiety about growth or creativity may be present.",
    "divinationMeaning": "In readings, Berkano suggests new beginnings that require gentle nurturing. Growth is occurring beneath the surface. Care for what you are creating and give it time to develop. Fertility matters are favored.",
    "magicalUses": [
      "Fertility and conception",
      "Nurturing new projects",
      "Healing and regeneration",
      "Protection of family",
      "Spring rituals and rebirth"
    ],
    "history": "The birch was the first tree to grow after the Ice Age, symbolizing rebirth and new beginnings. Berkano connects to the birch goddess Berchta and represents the feminine nurturing power that brings new life into being.",
    "affirmation": "I nurture new growth with love and patience, trusting in natural development."
  },
  "ehwaz": {
    "name": "Ehwaz",
    "meaning": "Horse",
    "symbol": "ᛖ",
    "pronunciation": "AY-wahz",
    "element": "Earth",
    "deity": "Freyr, Odin",
    "aett": "Tyr",
    "aettPosition": 3,
    "keywords": [
      "Partnership",
      "Trust",
      "Loyalty",
      "Movement",
      "Progress",
      "Teamwork"
    ],
    "magicalProperties": "Trust, loyalty, partnership",
    "notes": "Symbolizes partnerships and trust, used for strengthening alliances and relationships.",
    "uprightMeaning": "Ehwaz represents the horse and the sacred bond between horse and rider. It indicates partnership, trust, and harmonious movement toward goals. This rune brings steady progress, loyal relationships, and the power of teamwork. Movement is swift and sure when partners work in harmony.",
    "reversedMeaning": "Ehwaz reversed indicates discord in partnerships, mistrust, or blocked progress. Movement is hampered by lack of cooperation. Relationships may be unbalanced, or you may be trying to force progress without proper support.",
    "divinationMeaning": "In readings, Ehwaz suggests partnership is key to progress. Trust in your allies, work harmoniously with others, and movement will be swift. Marriage or business partnership matters are favored.",
    "magicalUses": [
      "Strengthening partnerships",
      "Speeding progress",
      "Travel spells",
      "Building trust",
      "Shamanic journeying"
    ],
    "history": "The horse was sacred throughout Germanic culture, used in warfare, travel, and religious ceremony. Ehwaz represents the ideal partnership where two beings move as one, trusting each other completely.",
    "affirmation": "I move forward in harmony with trusted partners toward shared goals."
  },
  "mannaz": {
    "name": "Mannaz",
    "meaning": "Man, Humanity",
    "symbol": "ᛗ",
    "pronunciation": "MAH-nahz",
    "element": "Air",
    "deity": "Odin, Heimdall",
    "aett": "Tyr",
    "aettPosition": 4,
    "keywords": [
      "Humanity",
      "Self",
      "Community",
      "Intelligence",
      "Culture",
      "Social Order"
    ],
    "magicalProperties": "Humanity, social relationships, self-knowledge",
    "notes": "Focuses on social relationships, personal alignment, and community assistance.",
    "uprightMeaning": "Mannaz represents humanity, the self, and our place within the social order. It indicates self-knowledge, cooperation with others, and the development of human potential. This rune brings clarity about yourself, assistance from community, and the wisdom to work well with others.",
    "reversedMeaning": "Mannaz reversed indicates self-delusion, isolation, or antisocial behavior. You may be out of alignment with yourself or your community. Cunning enemies, depression, or difficulty relating to others may be present.",
    "divinationMeaning": "In readings, Mannaz suggests examining yourself and your relationships. Seek self-knowledge, cooperate with others, and remember your humanity. Support from community is available if you reach for it.",
    "magicalUses": [
      "Self-knowledge and development",
      "Gaining assistance from others",
      "Enhancing intelligence",
      "Social harmony",
      "Memory and learning"
    ],
    "history": "Mannaz represents Ask and Embla, the first humans created by Odin and his brothers. The rune embodies human consciousness, social bonds, and the divine spark that makes humanity unique among beings.",
    "affirmation": "I know myself truly and work in harmony with my fellow beings."
  },
  "laguz": {
    "name": "Laguz",
    "meaning": "Water, Lake",
    "symbol": "ᛚ",
    "pronunciation": "LAH-gooz",
    "element": "Water",
    "deity": "Njord, Nerthus",
    "aett": "Tyr",
    "aettPosition": 5,
    "keywords": [
      "Water",
      "Intuition",
      "Emotions",
      "Flow",
      "Dreams",
      "Subconscious"
    ],
    "magicalProperties": "Intuition, emotions, the subconscious",
    "notes": "Connected to emotions and psychic abilities, aids in dream work and spiritual journeys.",
    "uprightMeaning": "Laguz represents water in all its forms—the sea, lake, and the depths of the subconscious. It indicates intuition, dreams, and the flow of emotional energy. This rune brings psychic awareness, emotional healing, and the ability to navigate the waters of feeling and imagination.",
    "reversedMeaning": "Laguz reversed indicates blocked intuition, emotional confusion, or fear of the depths. You may be drowning in emotions, ignoring intuitive messages, or experiencing psychic overwhelm. Fear of the unknown may paralyze you.",
    "divinationMeaning": "In readings, Laguz suggests trusting your intuition and emotional wisdom. Go with the flow, explore dreams, and honor your feelings. Water-related matters and psychic development are favored.",
    "magicalUses": [
      "Enhancing intuition and psychic ability",
      "Dream work and journeying",
      "Emotional healing",
      "Water magic",
      "Lunar and tide magic"
    ],
    "history": "Water was sacred throughout Norse culture as the source of life and the realm of deep mysteries. Laguz connects to Njord, god of the sea, and represents the vast ocean of the subconscious that underlies conscious awareness.",
    "affirmation": "I flow with intuitive wisdom and trust the depths of my inner knowing."
  },
  "ingwaz": {
    "name": "Ingwaz",
    "meaning": "Ing, the God",
    "symbol": "ᛜ",
    "pronunciation": "ING-wahz",
    "element": "Earth/Water",
    "deity": "Freyr/Ing",
    "aett": "Tyr",
    "aettPosition": 6,
    "keywords": [
      "Fertility",
      "Potential",
      "Gestation",
      "Integration",
      "Internal Growth",
      "Completion"
    ],
    "magicalProperties": "Potential, fertility, internal development",
    "notes": "Encapsulates potential energy, used for storing power and manifesting ideas into action.",
    "uprightMeaning": "Ingwaz represents the god Ing (Freyr) and the seed of potential energy. It indicates internal growth, gestation, and the integration of experience before manifestation. This rune brings fertility, the storing of power, and the completion of one phase before the next begins.",
    "reversedMeaning": "Ingwaz has no reversed position as it is symmetrical. In challenging contexts, it may indicate premature action, failed integration, or blocked fertility. The seed needs more time to develop.",
    "divinationMeaning": "In readings, Ingwaz suggests a time of internal development. Rest and integrate your experiences. What you are creating needs gestation before birth. Fertility and completion of cycles are indicated.",
    "magicalUses": [
      "Fertility magic",
      "Storing magical energy",
      "Completing cycles",
      "Internal integration",
      "Manifesting potential"
    ],
    "history": "Ing was an ancient god associated with fertility, later merged with Freyr. The rune represents the seed containing all potential—the concentrated power that will eventually manifest but requires time and the right conditions to unfold.",
    "affirmation": "I nurture my potential in patient gestation, trusting in perfect timing."
  },
  "dagaz": {
    "name": "Dagaz",
    "meaning": "Day, Dawn",
    "symbol": "ᛞ",
    "pronunciation": "DAH-gahz",
    "element": "Fire/Air",
    "deity": "Heimdall, Baldur",
    "aett": "Tyr",
    "aettPosition": 7,
    "keywords": [
      "Dawn",
      "Breakthrough",
      "Awakening",
      "Clarity",
      "Transformation",
      "Hope"
    ],
    "magicalProperties": "Awakening, clarity, breakthrough",
    "notes": "Represents breakthroughs and new beginnings, illuminates and transforms.",
    "uprightMeaning": "Dagaz represents the moment of dawn when darkness transforms into light. It indicates breakthrough, awakening, and sudden clarity. This rune brings the end of darkness, dramatic positive change, and the illumination of what was hidden. The long night ends; day has come.",
    "reversedMeaning": "Dagaz has no reversed position as it is symmetrical. In challenging contexts, it may indicate false dawn, blindness to available light, or fear of awakening. The breakthrough is available but may be resisted.",
    "divinationMeaning": "In readings, Dagaz promises breakthrough, awakening, and dramatic positive change. The darkness ends, clarity comes, and transformation occurs. Major shifts in awareness or circumstances are indicated.",
    "magicalUses": [
      "Bringing breakthrough and awakening",
      "Transformation rituals",
      "Dawn and light magic",
      "Ending darkness or depression",
      "Invisibility and transformation"
    ],
    "history": "Dagaz represents the mystical moment between night and day, the threshold of transformation. It embodies the dramatic shift from darkness to light that occurs each dawn—sudden, complete, and irreversible.",
    "affirmation": "I embrace awakening and step into the light of new understanding."
  },
  "othala": {
    "name": "Othala",
    "meaning": "Ancestral Property, Heritage",
    "symbol": "ᛟ",
    "pronunciation": "OH-thah-lah",
    "element": "Earth",
    "deity": "Odin, the Ancestors",
    "aett": "Tyr",
    "aettPosition": 8,
    "keywords": [
      "Heritage",
      "Ancestry",
      "Home",
      "Inheritance",
      "Family",
      "Tradition"
    ],
    "magicalProperties": "Heritage, inheritance, ancestral wisdom",
    "notes": "Strengthens ties to home and family, protects and retains wealth.",
    "uprightMeaning": "Othala represents ancestral property, heritage, and the accumulated wisdom of your bloodline. It indicates inheritance (material or spiritual), connection to home and family, and the wealth that comes from tradition. This rune brings the support of ancestors, stability of home, and the benefits of your inherited legacy.",
    "reversedMeaning": "Othala reversed indicates loss of inheritance, family discord, or disconnection from roots. Property may be lost, ancestral wisdom ignored, or family bonds broken. You may be homeless spiritually or physically.",
    "divinationMeaning": "In readings, Othala suggests connecting with your heritage and honoring family. Inheritance may be coming, or ancestral wisdom is needed. Matters of home, property, and family legacy are highlighted.",
    "magicalUses": [
      "Connecting with ancestors",
      "Protecting home and property",
      "Accessing inherited wisdom",
      "Family healing",
      "Building lasting foundations"
    ],
    "history": "Othala completes the Elder Futhark and represents the culmination of all that has come before—the inherited property, wisdom, and spiritual heritage passed down through generations. It is the wealth that cannot be taken because it is part of who you are.",
    "affirmation": "I honor my ancestors and carry forward the wisdom of my heritage."
  }
}
