{
  "majorArcana": {
    "theFool": {
      "name": "The Fool",
      "number": 0,
      "element": "Air",
      "planet": "Uranus",
      "zodiacSign": "Aquarius",
      "keywords": [
        "new beginnings",
        "innocence",
        "spontaneity",
        "a free spirit",
        "leap of faith",
        "adventure"
      ],
      "information": "The Fool represents new beginnings, taking a leap of faith, and embracing the unknown. It encourages spontaneity and a sense of adventure, reminding you to trust in the journey ahead and remain open to the possibilities that lie ahead.",
      "uprightMeaning": "The Fool upright represents the start of a new journey with unlimited potential. You stand at the precipice of adventure, ready to take a leap of faith into the unknown. This card encourages embracing your inner child, being open to new experiences, and trusting that the universe will support you. It suggests a time of optimism, freedom, and living in the moment without fear of judgment.",
      "reversedMeaning": "The Fool reversed suggests recklessness, poor judgment, or fear of taking necessary risks. You may be holding back from an important opportunity out of fear, or alternatively, you might be acting too impulsively without considering consequences. It can also indicate naivety that leads to being taken advantage of.",
      "symbolism": "The Fool carries a small bundle, representing untapped potential and experiences yet to come. The white rose symbolizes purity and innocence. The dog at his feet represents loyalty and protection, while also warning of danger as The Fool approaches a cliff edge, blissfully unaware. The mountains behind represent challenges ahead, while the sun shines brightly, blessing the journey.",
      "loveMeaning": "In love readings, The Fool suggests new romantic beginnings, spontaneous connections, or bringing fresh energy to existing relationships. For singles, it indicates being open to unexpected love. In partnerships, it suggests adventure and rediscovering the playful aspects of your connection.",
      "careerMeaning": "In career readings, The Fool indicates new job opportunities, starting a business, or taking a bold career leap. It encourages following your passion regardless of conventional expectations and reminds you that every expert was once a beginner.",
      "affirmation": "I embrace new beginnings with an open heart and trust in my journey."
    },
    "theMagician": {
      "name": "The Magician",
      "number": 1,
      "element": "Air",
      "planet": "Mercury",
      "zodiacSign": "Gemini",
      "keywords": [
        "manifestation",
        "resourcefulness",
        "power",
        "inspired action",
        "willpower",
        "skill"
      ],
      "information": "The Magician signifies the ability to turn ideas into reality through focused intention and action. It symbolizes resourcefulness, skill, and the power to manifest your desires, highlighting the importance of utilizing your talents and taking inspired action.",
      "uprightMeaning": "The Magician upright signifies you have all the tools and resources needed to manifest your desires. This is a powerful card of action, skill, and concentration. You are being called to tap into your full potential and use your talents wisely. The Magician reminds you that you are the creator of your reality—your thoughts, words, and actions shape your world.",
      "reversedMeaning": "The Magician reversed warns of manipulation, trickery, or misuse of power. It may indicate unfulfilled potential, scattered energy, or someone deceiving you. You might be doubting your abilities or failing to use your talents effectively. This can also suggest blocked creativity or communication problems.",
      "symbolism": "The Magician stands with one arm raised to heaven and one pointing to earth, representing the phrase \"as above, so below.\" On the table before him lie the four suit symbols (cup, pentacle, sword, wand), representing all the elements and resources at his disposal. The infinity symbol above his head represents unlimited potential, while the snake belt (ouroboros) symbolizes eternal cycles.",
      "loveMeaning": "In love readings, The Magician suggests taking initiative in romance. It indicates charm, charisma, and the power to attract what you desire. For existing relationships, it suggests improved communication and actively creating the relationship you want.",
      "careerMeaning": "In career readings, The Magician is highly favorable for new ventures, negotiations, and using your skills. It suggests you have everything needed to succeed—now is the time for action. It can indicate careers involving communication, technology, or requiring versatile skills.",
      "affirmation": "I have the power to create my reality through focused intention and action."
    },
    "theHighPriestess": {
      "name": "The High Priestess",
      "number": 2,
      "element": "Water",
      "planet": "Moon",
      "zodiacSign": "Cancer",
      "keywords": [
        "intuition",
        "sacred knowledge",
        "divine feminine",
        "the subconscious mind",
        "mystery",
        "inner voice"
      ],
      "information": "The High Priestess embodies wisdom, intuition, and the deep mysteries of the subconscious. She encourages you to trust your inner voice and seek knowledge from within. This card often suggests a time of introspection and heightened intuition.",
      "uprightMeaning": "The High Priestess upright calls you to look inward and trust your intuition. She represents hidden knowledge, psychic abilities, and the mysteries that lie beneath the surface. This card suggests that answers you seek cannot be found through logic alone—you must listen to your inner voice and pay attention to dreams and subtle signs. She guards the threshold between the conscious and unconscious realms.",
      "reversedMeaning": "The High Priestess reversed indicates ignoring your intuition or being disconnected from your inner wisdom. You may be giving away your power to others, keeping secrets that burden you, or experiencing blocked psychic abilities. It can also suggest hidden agendas from others or information being withheld.",
      "symbolism": "The High Priestess sits between two pillars, B (Boaz) and J (Jachin), representing duality and the threshold between worlds. The pomegranates on the veil behind her symbolize fertility and the feminine mysteries. The crescent moon at her feet represents her rulership over intuition and the unconscious. She holds the Torah, representing hidden knowledge.",
      "loveMeaning": "In love readings, The High Priestess suggests trusting your gut feelings about a relationship. She may indicate a need for patience, as all has not yet been revealed. For singles, she suggests someone mysterious may enter your life, or you need to become comfortable with yourself before love arrives.",
      "careerMeaning": "In career readings, The High Priestess suggests using intuition in professional decisions. She may indicate hidden opportunities, the need for confidentiality, or careers involving healing, counseling, or spiritual work. Trust that knowledge will be revealed when the time is right.",
      "affirmation": "I trust my inner wisdom and honor the mysteries within me."
    },
    "theEmpress": {
      "name": "The Empress",
      "number": 3,
      "element": "Earth",
      "planet": "Venus",
      "zodiacSign": "Taurus",
      "keywords": [
        "femininity",
        "beauty",
        "nature",
        "nurturing",
        "abundance",
        "fertility",
        "creativity"
      ],
      "information": "The Empress represents fertility, nurturing, and the beauty of nature. She signifies abundance, creativity, and the power of the feminine. This card encourages you to connect with your nurturing side and appreciate the beauty and bounty around you.",
      "uprightMeaning": "The Empress upright embodies creative abundance, fertility, and the nurturing aspect of the divine feminine. She represents motherhood, sensuality, and connection to nature. This card encourages you to embrace pleasure, create beauty, and nurture your projects and relationships. The Empress brings growth and prosperity when you align with natural cycles and creative flow.",
      "reversedMeaning": "The Empress reversed may indicate creative blocks, neglecting self-care, or smothering behavior. It can suggest dependency issues, fertility challenges, or disconnect from your feminine energy. You might be giving too much to others while depleting yourself, or experiencing difficulty receiving nurturing.",
      "symbolism": "The Empress sits on a cushioned throne amid lush nature, representing her dominion over the earthly realm. Her crown of twelve stars represents her connection to the zodiac. The heart-shaped shield with Venus symbol emphasizes love and beauty. Wheat grows at her feet, symbolizing abundance and harvest. The waterfall and forest represent the fertile, life-giving forces of nature.",
      "loveMeaning": "In love readings, The Empress is one of the most positive cards. She suggests romance, passion, and deepening emotional bonds. For those wanting children, she can indicate pregnancy or fertility. She represents loving relationships characterized by nurturing, sensuality, and mutual growth.",
      "careerMeaning": "In career readings, The Empress suggests creative projects flourishing, business growth, and harmonious work environments. She favors careers in beauty, art, nature, or nurturing professions. This is an excellent time for creative ventures and collaborative projects.",
      "affirmation": "I nurture abundance in all areas of my life and embrace my creative power."
    },
    "theEmperor": {
      "name": "The Emperor",
      "number": 4,
      "element": "Fire",
      "planet": "Mars",
      "zodiacSign": "Aries",
      "keywords": [
        "authority",
        "establishment",
        "structure",
        "a father figure",
        "leadership",
        "stability"
      ],
      "information": "The Emperor stands for authority, structure, and control. He embodies the qualities of a strong leader and a father figure. This card suggests a need for discipline, order, and strategic planning to achieve your goals.",
      "uprightMeaning": "The Emperor upright represents structure, authority, and masculine power. He is the father figure, leader, and builder of empires. This card suggests establishing order, setting boundaries, and taking a disciplined approach to achieve your goals. The Emperor brings stability through logic, strategy, and firm foundations. He encourages you to take charge and lead with wisdom.",
      "reversedMeaning": "The Emperor reversed can indicate tyranny, rigidity, or abuse of power. It may suggest a domineering figure in your life, or your own inflexibility causing problems. This card can also represent weakness in leadership, lack of discipline, or rebellion against authority figures.",
      "symbolism": "The Emperor sits on a throne adorned with rams, symbolizing Aries and assertive energy. His long white beard represents wisdom gained through experience. In one hand he holds an ankh (life) and in the other an orb (dominion). The orange robe represents passion and vitality, while the armor beneath shows readiness for battle. The barren mountains behind represent his achievements built through will.",
      "loveMeaning": "In love readings, The Emperor suggests a stable, committed relationship with clear roles. He may represent a protective partner or the need to establish boundaries. For singles, he can indicate meeting someone authoritative or the need to develop self-discipline before love.",
      "careerMeaning": "In career readings, The Emperor indicates leadership positions, promotions, and business success through strategic planning. He favors structured environments and suggests building something lasting. This is an excellent time to implement systems and establish your authority.",
      "affirmation": "I lead with wisdom and create stable foundations for my success."
    },
    "theHierophant": {
      "name": "The Hierophant",
      "number": 5,
      "element": "Earth",
      "planet": "Venus",
      "zodiacSign": "Taurus",
      "keywords": [
        "spiritual wisdom",
        "religious beliefs",
        "conformity",
        "tradition",
        "institutions",
        "mentorship"
      ],
      "information": "The Hierophant represents traditional values, spiritual wisdom, and the institutions that uphold them. It encourages learning through established systems and seeking guidance from trusted mentors or teachers. This card can also signify a need for conformity and adherence to established norms.",
      "uprightMeaning": "The Hierophant upright represents tradition, spiritual wisdom, and conventional approaches. He is the teacher, mentor, and bridge between the divine and earthly realms. This card suggests seeking guidance from established institutions, honoring traditions, or pursuing formal education. The Hierophant encourages finding meaning through shared beliefs and community practices.",
      "reversedMeaning": "The Hierophant reversed challenges conventional thinking and rigid belief systems. It can indicate breaking from tradition, questioning authority, or finding your own spiritual path outside organized religion. This card may suggest that conventional approaches are not serving you.",
      "symbolism": "The Hierophant wears the triple crown representing mastery of mind, body, and spirit. His raised right hand gives a blessing, while the left holds the papal cross (triple realm of dominion). Two acolytes kneel before him, representing the transmission of knowledge. The crossed keys at his feet symbolize the keys to heaven—conscious and subconscious knowledge.",
      "loveMeaning": "In love readings, The Hierophant often indicates traditional relationships, marriage, or commitment ceremonies. He suggests shared values and spiritual connection are important. This card can indicate meeting someone through religious or educational institutions.",
      "careerMeaning": "In career readings, The Hierophant suggests success through traditional paths, formal education, or established institutions. He favors teaching, counseling, religious work, or any career requiring mentorship. Following conventional career paths may serve you well now.",
      "affirmation": "I honor wisdom traditions while finding my own spiritual truth."
    },
    "theLovers": {
      "name": "The Lovers",
      "number": 6,
      "element": "Air",
      "planet": "Mercury",
      "zodiacSign": "Gemini",
      "keywords": [
        "love",
        "harmony",
        "relationships",
        "values alignment",
        "choices",
        "union",
        "partnership"
      ],
      "information": "The Lovers card symbolizes deep emotional connections, harmony, and the choices that shape our relationships. It highlights the importance of aligning values and making decisions that honor your true feelings and commitments.",
      "uprightMeaning": "The Lovers upright represents deep connection, harmony, and meaningful choices. While often associated with romantic love, this card fundamentally concerns alignment—of values, of self with other, of heart with mind. It asks you to consider what you truly value and make choices that honor your authentic self. The Lovers indicates a pivotal decision that will shape your path.",
      "reversedMeaning": "The Lovers reversed suggests disharmony, imbalanced relationships, or poor choices. It may indicate a relationship lacking mutual respect, internal conflict about values, or avoidance of important decisions. You might be compromising yourself or facing the consequences of choices made from the wrong motivations.",
      "symbolism": "A man and woman stand naked (vulnerability) beneath the angel Raphael, who blesses their union. Behind the woman is the Tree of Knowledge with the serpent, representing temptation and choice. Behind the man is the Tree of Life with flames, representing passion and desire. The mountain between them represents the challenges love must overcome.",
      "loveMeaning": "In love readings, The Lovers is highly positive, indicating soulmate connections, deepening romance, or choosing a partner. It emphasizes the importance of mutual respect, open communication, and shared values. For singles, significant romantic connections are indicated.",
      "careerMeaning": "In career readings, The Lovers suggests important professional decisions, partnerships, or aligning your work with your values. It can indicate choosing between career paths or the need to collaborate effectively with others.",
      "affirmation": "I choose love and align my decisions with my deepest values."
    },
    "theChariot": {
      "name": "The Chariot",
      "number": 7,
      "element": "Water",
      "planet": "Moon",
      "zodiacSign": "Cancer",
      "keywords": [
        "control",
        "willpower",
        "success",
        "action",
        "determination",
        "victory",
        "drive"
      ],
      "information": "The Chariot signifies triumph through determination and willpower. It represents control over one's direction and the drive to succeed. This card encourages focused action and confidence in overcoming obstacles to reach your goals.",
      "uprightMeaning": "The Chariot upright represents victory through willpower, determination, and focused action. You are being called to take the reins and direct your life with purpose. This card indicates overcoming obstacles through sheer force of will and maintaining control over opposing forces within yourself. Success comes through discipline and staying the course.",
      "reversedMeaning": "The Chariot reversed suggests lack of direction, scattered energy, or being overwhelmed by obstacles. You may be struggling to control competing desires or external forces. It can indicate aggression, lack of control, or pursuing goals for the wrong reasons.",
      "symbolism": "The charioteer wears armor adorned with crescent moons (emotions) and squares (will). A canopy of stars connects him to the cosmos. Two sphinxes (one black, one white) represent opposing forces that must be balanced and directed. There are no reins—control comes through will alone. The city behind represents civilization conquered, while the river represents emotions mastered.",
      "loveMeaning": "In love readings, The Chariot suggests taking action in matters of the heart. It may indicate pursuing someone with determination, overcoming relationship obstacles, or the need to balance head and heart. Success in love requires clear direction and effort.",
      "careerMeaning": "In career readings, The Chariot strongly favors success, promotions, and achievement of professional goals. It indicates recognition for hard work and the discipline to overcome workplace challenges. Excellent for competitive situations.",
      "affirmation": "I direct my life with purpose and overcome all obstacles through focused will."
    },
    "strength": {
      "name": "Strength",
      "number": 8,
      "element": "Fire",
      "planet": "Sun",
      "zodiacSign": "Leo",
      "keywords": [
        "courage",
        "persuasion",
        "influence",
        "compassion",
        "inner strength",
        "patience",
        "bravery"
      ],
      "information": "Strength embodies courage, compassion, and inner resilience. It highlights the power of gentle persuasion and the importance of self-control. This card suggests that true strength lies in understanding and mastering your emotions and reactions.",
      "uprightMeaning": "Strength upright represents inner courage, compassion, and the quiet power of a gentle spirit. True strength is not about force but about patience, self-control, and understanding. This card shows you have the resilience to face challenges with grace. Through love and acceptance, you can tame your inner beasts and influence others not through aggression but through compassionate presence.",
      "reversedMeaning": "Strength reversed indicates self-doubt, weakness, or raw emotions running unchecked. You may be giving in to fear, lacking confidence, or allowing your shadow side to dominate. It can suggest the need to develop patience or that you are being too hard on yourself.",
      "symbolism": "A woman gently closes the jaws of a lion, symbolizing mastering primal instincts through love rather than force. The infinity symbol above her head represents infinite potential and spiritual power. White robes indicate purity of spirit. The lion represents raw passion and desire. Mountains in the background show challenges overcome. Flowers adorn her, representing the beauty that blooms from inner strength.",
      "loveMeaning": "In love readings, Strength suggests passion balanced with compassion. It indicates relationships based on mutual respect and gentle understanding. This card encourages patience with partners and the courage to be vulnerable.",
      "careerMeaning": "In career readings, Strength indicates success through persistence, diplomacy, and emotional intelligence. It favors careers requiring patience and working with challenging people or situations. Lead with compassion rather than dominance.",
      "affirmation": "My gentle strength and compassion guide me through all challenges."
    },
    "theHermit": {
      "name": "The Hermit",
      "number": 9,
      "element": "Earth",
      "planet": "Mercury",
      "zodiacSign": "Virgo",
      "keywords": [
        "soul-searching",
        "introspection",
        "being alone",
        "inner guidance",
        "wisdom",
        "solitude"
      ],
      "information": "The Hermit represents a period of introspection and self-discovery. It encourages you to seek solitude and inner guidance to find answers within yourself. This card often suggests the need for reflection and a deeper understanding of your spiritual path.",
      "uprightMeaning": "The Hermit upright calls you to withdraw from the noise of the world and seek answers within. This is a time for contemplation, soul-searching, and connecting with your inner teacher. The Hermit has walked the path before and now carries the lantern of wisdom to light the way. Solitude is not loneliness—it is the necessary space for profound self-discovery and spiritual growth.",
      "reversedMeaning": "The Hermit reversed may indicate excessive isolation, withdrawal from life, or resistance to introspection. You might be avoiding necessary self-reflection or, conversely, isolating yourself unhealthily. It can also suggest the need to come out of your shell and share your wisdom.",
      "symbolism": "The Hermit stands on a snowy mountain peak, representing spiritual achievement and withdrawal from material concerns. His gray cloak represents invisibility from the mundane world. The lantern contains a six-pointed star (the Seal of Solomon), representing divine wisdom. His staff represents authority and the support of his inner journey.",
      "loveMeaning": "In love readings, The Hermit suggests a period of solitude for self-reflection, which may be necessary before or within relationships. It can indicate a wise partner, the need for personal space, or taking time to understand what you truly want in love.",
      "careerMeaning": "In career readings, The Hermit suggests working independently, research, or mentoring. It may indicate taking time away from work for reflection or pursuing wisdom-based careers. Sometimes it suggests that the answers lie in your own experience.",
      "affirmation": "In solitude, I discover the wisdom that illuminates my path."
    },
    "wheelOfFortune": {
      "name": "Wheel of Fortune",
      "number": 10,
      "element": "Fire",
      "planet": "Jupiter",
      "zodiacSign": "Sagittarius",
      "keywords": [
        "good luck",
        "karma",
        "life cycles",
        "destiny",
        "a turning point",
        "fate",
        "change"
      ],
      "information": "The Wheel of Fortune signifies cycles of change, destiny, and the ebb and flow of life's fortunes. It reminds you that what goes around comes around, and encourages you to embrace the changes and opportunities that come your way.",
      "uprightMeaning": "The Wheel of Fortune upright signals significant change, cycles completing, and fate turning in your favor. Life is always moving—what rises must fall, and what falls will rise again. This card reminds you that change is the only constant. When the wheel spins, embrace it. Good fortune comes to those who understand that karma and cosmic timing play roles in life's unfolding.",
      "reversedMeaning": "The Wheel of Fortune reversed may indicate bad luck, resistance to change, or being stuck in negative cycles. It can suggest external circumstances blocking progress or karma from past actions manifesting. Remember: even when reversed, the wheel will turn again.",
      "symbolism": "The wheel contains Hebrew letters (YHVH) and the word TARO (or ROTA for wheel). Four figures at corners represent the fixed signs of the zodiac (lion/Leo, bull/Taurus, eagle/Scorpio, angel/Aquarius) and the four elements. Anubis rises on one side (ascending fortune), while a serpent descends (descending fortune). The sphinx at top holds a sword of discernment.",
      "loveMeaning": "In love readings, The Wheel of Fortune suggests fateful meetings, significant turning points in relationships, or karmic connections. It reminds you that relationships go through cycles and that change can bring positive developments.",
      "careerMeaning": "In career readings, The Wheel of Fortune indicates fortunate changes, unexpected opportunities, or important career turning points. It favors taking calculated risks and remaining adaptable as circumstances shift.",
      "affirmation": "I embrace life's cycles and trust in the turning of fortune."
    },
    "justice": {
      "name": "Justice",
      "number": 11,
      "element": "Air",
      "planet": "Venus",
      "zodiacSign": "Libra",
      "keywords": [
        "justice",
        "fairness",
        "truth",
        "cause and effect",
        "law",
        "balance",
        "karma"
      ],
      "information": "Justice represents fairness, truth, and the law of cause and effect. It signifies the need for balance and ethical decisions. This card encourages you to act with integrity and seek fairness in all your interactions.",
      "uprightMeaning": "Justice upright represents truth, fairness, and the law of cause and effect. Every action has consequences, and Justice ensures that balance is restored. This card calls for honesty, taking responsibility, and making decisions with clarity and integrity. Legal matters may be resolved in your favor if you have acted justly. Truth will come to light.",
      "reversedMeaning": "Justice reversed warns of unfairness, dishonesty, or avoiding accountability. It may indicate legal problems, biased judgment, or refusing to see the truth of a situation. Someone may be getting away with wrongdoing, or you may need to examine your own integrity.",
      "symbolism": "Justice sits between two pillars (like The High Priestess), representing balance between intuition and logic. She holds scales in her left hand (weighing evidence fairly) and a sword in her right (cutting through deception to truth). Her red robe represents passion for justice, while the green mantle shows growth through fairness. A crown indicates authority.",
      "loveMeaning": "In love readings, Justice suggests fairness and balance in relationships. It may indicate legal matters like marriage or divorce. This card asks you to be honest with yourself and partners about what is fair and true.",
      "careerMeaning": "In career readings, Justice favors legal professions, negotiations, and contracts. It indicates fair outcomes based on merit and accountability. Ensure all dealings are honest and ethical.",
      "affirmation": "I act with integrity and trust that truth creates balance."
    },
    "theHangedMan": {
      "name": "The Hanged Man",
      "number": 12,
      "element": "Water",
      "planet": "Neptune",
      "zodiacSign": "Pisces",
      "keywords": [
        "pause",
        "surrender",
        "letting go",
        "new perspectives",
        "sacrifice",
        "waiting"
      ],
      "information": "The Hanged Man symbolizes a voluntary pause and the need to let go of control to gain a new perspective. It suggests surrendering to the process and allowing time for contemplation and insight. This card often indicates a period of waiting or suspension.",
      "uprightMeaning": "The Hanged Man upright invites you to pause, surrender, and see the world from a new perspective. This is not about being stuck but about voluntary sacrifice for spiritual growth. Sometimes the greatest progress comes from standing still. Let go of controlling outcomes, release old patterns of thinking, and trust that this period of suspension serves a higher purpose.",
      "reversedMeaning": "The Hanged Man reversed suggests resistance to necessary sacrifice, stalling, or refusing to see things differently. You may be clinging to old ways despite knowing change is needed. It can also indicate that a period of waiting is ending.",
      "symbolism": "A man hangs upside-down from a T-shaped cross (the World Tree), one leg crossed in a figure-four position. His halo indicates enlightenment gained through sacrifice. His serene expression shows acceptance rather than suffering. The tree is living, suggesting this sacrifice brings new life. The inversion represents seeing the world from a completely different perspective.",
      "loveMeaning": "In love readings, The Hanged Man suggests taking a step back from relationship situations. It may indicate sacrifice for love, waiting for someone, or the need to release attachment to specific outcomes. New perspectives on love may emerge.",
      "careerMeaning": "In career readings, The Hanged Man indicates pausing career advancement, possibly voluntarily. It may suggest sabbaticals, changing perspectives on work, or waiting for the right opportunity rather than forcing progress.",
      "affirmation": "I surrender to life's wisdom and see the world with new eyes."
    },
    "death": {
      "name": "Death",
      "number": 13,
      "element": "Water",
      "planet": "Pluto",
      "zodiacSign": "Scorpio",
      "keywords": [
        "endings",
        "change",
        "transformation",
        "transition",
        "rebirth",
        "letting go"
      ],
      "information": "Death signifies the end of a cycle and the beginning of transformation. It represents significant change and the shedding of the old to make way for the new. This card encourages acceptance of endings as a natural part of growth and renewal.",
      "uprightMeaning": "Death upright represents profound transformation, endings that make way for new beginnings, and the necessity of letting go. This card rarely indicates physical death—instead, it signals the death of old ways, relationships, beliefs, or phases of life. Transformation is inevitable and resisting it only prolongs suffering. Embrace the change; something better awaits beyond this threshold.",
      "reversedMeaning": "Death reversed suggests resistance to necessary change, fear of transformation, or stagnation. You may be clinging to what no longer serves you or experiencing a slow, difficult transition. Sometimes it indicates that a major change has been averted, for better or worse.",
      "symbolism": "The skeleton knight (Death as the great equalizer) rides a white horse (purity of transformation), carrying a flag with a white rose (new life). People of all stations fall before him, showing that death comes for all. The sun sets between two towers (death of the old), but also rises (promise of renewal). A river flows in the background (emotions, and the river Styx).",
      "loveMeaning": "In love readings, Death indicates the end of a relationship phase or the relationship itself. It can represent necessary transformation in how you approach love, or clearing away unhealthy patterns. From endings come new beginnings.",
      "careerMeaning": "In career readings, Death suggests major professional changes—job endings, career transitions, or complete transformation of your work life. While initially challenging, these changes lead to growth and new opportunities.",
      "affirmation": "I release what no longer serves me and embrace transformation."
    },
    "temperance": {
      "name": "Temperance",
      "number": 14,
      "element": "Fire",
      "planet": "Jupiter",
      "zodiacSign": "Sagittarius",
      "keywords": [
        "balance",
        "moderation",
        "patience",
        "purpose",
        "harmony",
        "healing",
        "integration"
      ],
      "information": "Temperance symbolizes balance, harmony, and moderation. It encourages patience and finding the middle path. This card suggests the importance of blending different aspects of your life to create a cohesive and fulfilling whole.",
      "uprightMeaning": "Temperance upright calls for balance, moderation, and the patient blending of opposites. Like an alchemist mixing elements, you are being asked to integrate different aspects of your life into harmony. This card represents healing, finding the middle path, and allowing things to flow naturally. Patience and calm purpose will serve you better than extreme actions.",
      "reversedMeaning": "Temperance reversed indicates imbalance, excess, or lack of patience. You may be acting in extremes, struggling to find harmony, or rushing processes that need time. It can suggest discord, overindulgence, or difficulties healing.",
      "symbolism": "An angel (Archangel Michael) pours water between two cups, representing the flow and balance of life forces. One foot in water (subconscious) and one on land (material world) shows balance between realms. The triangle within the square on the robe represents spirit contained in matter. Irises (Greek goddess Iris, messenger) bloom nearby. The path leads to mountains (spiritual ascent) with a crown (ultimate achievement).",
      "loveMeaning": "In love readings, Temperance suggests balanced, harmonious relationships. It indicates patience in romance, healing of relationship wounds, and the blending of two lives into one partnership. Soul connections are favored.",
      "careerMeaning": "In career readings, Temperance favors collaboration, patience in projects, and balanced approaches. It suggests careers in healing, diplomacy, or any field requiring careful blending of elements. Moderate, steady progress is indicated.",
      "affirmation": "I blend all aspects of my life into perfect harmony and balance."
    },
    "theDevil": {
      "name": "The Devil",
      "number": 15,
      "element": "Earth",
      "planet": "Saturn",
      "zodiacSign": "Capricorn",
      "keywords": [
        "Shadow self",
        "attachment",
        "addiction",
        "restriction",
        "sexuality",
        "bondage",
        "materialism",
        "temptation"
      ],
      "information": "The Devil represents the darker aspects of the self, including attachments, addictions, and materialism. It highlights the chains that bind you and encourages you to confront and overcome your fears and temptations.",
      "uprightMeaning": "The Devil upright indicates you may be trapped in unhealthy patterns, addictions, or toxic relationships. The chains binding the figures in the card are loose—you can remove them at any time. This card asks you to examine what holds you back: materialism, codependency, substance abuse, or fear. It also represents raw sexuality and passion. The Devil is not inherently evil; it reveals what lurks in your shadow so you can integrate and heal these aspects.",
      "reversedMeaning": "The Devil reversed signals liberation and breaking free from bondage. You are releasing attachments, overcoming addictions, or leaving toxic situations. This can be a powerful moment of reclaiming your power and recognizing that you are not defined by your shadow. Sometimes it warns of denial—refusing to see unhealthy patterns that need addressing.",
      "symbolism": "The Devil card depicts Baphomet, a half-goat, half-human figure representing the balance of opposites. Two naked humans stand chained below, but their chains are loose, symbolizing self-imposed bondage. The inverted pentagram on the Devil's head represents the material over the spiritual. The torch held downward ignites primal desires. The figures have small horns and tails, showing how prolonged attachment transforms us.",
      "loveMeaning": "In love readings, The Devil can indicate intense passion and sexual chemistry, but also codependency, jealousy, or staying in unhealthy relationships. It asks you to examine whether fear or genuine love keeps you in a partnership. For singles, it may suggest attraction to unavailable or toxic people.",
      "careerMeaning": "In career readings, The Devil suggests feeling trapped in your job, working for money rather than purpose, or unethical business practices. It may indicate workaholism or staying in a toxic workplace out of fear. The card encourages you to examine whether golden handcuffs keep you bound to unfulfilling work.",
      "affirmation": "I acknowledge my shadow self and choose to release what no longer serves me."
    },
    "theTower": {
      "name": "The Tower",
      "number": 16,
      "element": "Fire",
      "planet": "Mars",
      "zodiacSign": "Aries",
      "keywords": [
        "sudden change",
        "upheaval",
        "chaos",
        "revelation",
        "awakening",
        "destruction",
        "liberation"
      ],
      "information": "The Tower signifies sudden upheaval and revelation. It represents the breaking down of old structures and beliefs to make way for new insights and growth. This card often indicates a dramatic change or awakening that challenges your current situation.",
      "uprightMeaning": "The Tower upright represents sudden, disruptive change that shatters illusions and false structures. What was built on unstable foundations must fall. While initially shocking and often painful, Tower moments ultimately liberate us from situations, beliefs, or relationships that were never serving our highest good. This is divine intervention—the universe clearing away what blocks your path.",
      "reversedMeaning": "The Tower reversed may indicate resisting inevitable change, delayed upheaval, or a less dramatic transformation. You might be sensing disaster approaching and have time to prepare, or you could be clinging to structures that need to fall. Sometimes it represents internal transformation rather than external events.",
      "symbolism": "A lightning bolt (divine intervention) strikes a tower (ego/false beliefs), setting it ablaze. Two figures fall from the tower, representing the fall from ego and release from imprisonment. The crown blown from the tower represents overthrown material concerns. Twenty-two flames represent the 22 paths of the Tree of Life and the 22 Major Arcana. The dark sky suggests crisis, but also the clearing of illusion.",
      "loveMeaning": "In love readings, The Tower indicates relationship upheaval, sudden breakups, or revelations that change everything. While painful, these changes often reveal truths that needed acknowledgment. Sometimes it indicates the destruction of barriers to love.",
      "careerMeaning": "In career readings, The Tower suggests job loss, company restructuring, or sudden career changes. It may indicate realizing a career path is wrong for you. Though disruptive, these changes often lead to more authentic work.",
      "affirmation": "I release what no longer serves me and trust in divine intervention."
    },
    "theStar": {
      "name": "The Star",
      "number": 17,
      "element": "Air",
      "planet": "Uranus",
      "zodiacSign": "Aquarius",
      "keywords": [
        "hope",
        "faith",
        "purpose",
        "renewal",
        "spirituality",
        "inspiration",
        "healing"
      ],
      "information": "The Star represents hope, inspiration, and a renewed sense of purpose. It encourages faith in the future and trust in the universe. This card suggests a period of healing and spiritual growth, bringing clarity and tranquility.",
      "uprightMeaning": "The Star upright brings hope, healing, and renewed faith after difficulty. Following The Tower's destruction comes this beautiful calm—a reminder that even after the darkest night, stars appear. This card represents spiritual renewal, inspiration, and connection to the divine. Pour your energy generously; the universe replenishes what you give. Trust that you are exactly where you need to be.",
      "reversedMeaning": "The Star reversed indicates loss of hope, disconnection from spirit, or creative blocks. You may be feeling uninspired, disconnected from your purpose, or doubtful that things will improve. Faith needs to be rekindled. It can also suggest unrealistic expectations.",
      "symbolism": "A nude woman (vulnerability, truth) kneels by a pool, pouring water onto land (material nourishment) and into the pool (emotional/spiritual nourishment). The large yellow star (the light of guidance) is surrounded by seven smaller white stars (the seven chakras). One foot in water (intuition) and one on land (practical grounding). An ibis in the tree represents thought and Thoth.",
      "loveMeaning": "In love readings, The Star brings hope for romance, healing after heartbreak, and soulmate connections. It suggests open, honest, vulnerable love. For those healing from past relationships, renewal is coming.",
      "careerMeaning": "In career readings, The Star indicates hope for professional dreams, creative inspiration, and recognition. It favors creative and humanitarian careers. Trust your unique talents; your light is meant to shine.",
      "affirmation": "I am filled with hope and trust in the universe's plan for me."
    },
    "theMoon": {
      "name": "The Moon",
      "number": 18,
      "element": "Water",
      "planet": "Neptune",
      "zodiacSign": "Pisces",
      "keywords": [
        "illusion",
        "fear",
        "anxiety",
        "subconscious",
        "intuition",
        "dreams",
        "shadow"
      ],
      "information": "The Moon signifies illusion, intuition, and the subconscious. It highlights the murky and uncertain aspects of life, encouraging you to trust your intuition and confront your fears. This card often indicates confusion and the need to navigate through emotional depths.",
      "uprightMeaning": "The Moon upright represents illusion, fear, and the murky depths of the subconscious. Things are not as they seem—deception, confusion, and hidden fears cloud your perception. This is the realm of dreams, intuition, and shadow work. The Moon calls you to confront what lurks beneath the surface and to trust your intuition even when the path is unclear. Face your fears; they are often distorted reflections.",
      "reversedMeaning": "The Moon reversed suggests illusions lifting, clarity emerging, or suppressed fears surfacing. You may be gaining understanding of confusing situations or releasing anxiety. It can also indicate ignoring intuition or self-deception finally being acknowledged.",
      "symbolism": "The moon's face (with both sun and moon aspects) illuminates a strange landscape. A dog and wolf (tamed and wild aspects of mind) howl at the moon. A crayfish (primal unconscious) emerges from the pool of the subconscious. Two towers mark the boundary between known and unknown. The path winds between them into unknown darkness. Yods (divine blessing) fall from the sky.",
      "loveMeaning": "In love readings, The Moon warns of deception, unclear intentions, or hidden aspects of a relationship. Trust your intuition about partners. It can indicate fears affecting relationships or the need to address shadow aspects of love.",
      "careerMeaning": "In career readings, The Moon suggests confusion, deception, or unclear professional situations. Trust your instincts about workplace dynamics. It may indicate creative or intuitive careers, but warns against business dealings where all is not revealed.",
      "affirmation": "I trust my intuition to guide me through uncertainty and illusion."
    },
    "theSun": {
      "name": "The Sun",
      "number": 19,
      "element": "Fire",
      "planet": "Sun",
      "zodiacSign": "Leo",
      "keywords": [
        "positivity",
        "fun",
        "warmth",
        "success",
        "vitality",
        "joy",
        "optimism",
        "abundance"
      ],
      "information": "The Sun symbolizes joy, success, and vitality. It represents positive energy, happiness, and a sense of accomplishment. This card encourages you to embrace life with enthusiasm and confidence, knowing that you are on the right path.",
      "uprightMeaning": "The Sun upright is one of the most positive cards in the deck, representing joy, success, vitality, and abundance. The darkness has passed; clarity and warmth return. This card brings optimism, confidence, and the simple happiness of being alive. Children play, flowers bloom, and life celebrates itself. Success is indicated in all areas. Allow yourself to shine brightly and share your light.",
      "reversedMeaning": "The Sun reversed may indicate temporary setbacks to happiness, diminished confidence, or difficulty seeing the positive. The sun still shines, but clouds obscure it. You might be struggling to feel optimistic or experiencing delays in success. Inner child wounds may need healing.",
      "symbolism": "A child (innocence, joy) rides a white horse (purity, strength) under an enormous sun with a face (conscious awareness, divine source). Sunflowers (devotion to the light) fill the garden behind. The red banner represents life force and passion. The child wears no clothes, symbolizing having nothing to hide—pure authenticity. The gray wall represents achievement of what was once a challenge.",
      "loveMeaning": "In love readings, The Sun indicates joyful, warm relationships full of happiness and compatibility. It suggests marriage, pregnancy, or simply the joy of being with your partner. For singles, bright romantic prospects are indicated.",
      "careerMeaning": "In career readings, The Sun promises success, recognition, and achievement. Projects succeed, promotions come, and work brings joy. It favors any career involving children, creativity, or bringing light to others.",
      "affirmation": "I shine my light brightly and embrace the joy of life."
    },
    "judgement": {
      "name": "Judgement",
      "number": 20,
      "element": "Fire",
      "planet": "Pluto",
      "zodiacSign": "Scorpio",
      "keywords": [
        "judgement",
        "rebirth",
        "inner calling",
        "absolution",
        "awakening",
        "reckoning",
        "reflection"
      ],
      "information": "Judgement signifies a period of reflection and evaluation. It represents rebirth, awakening, and the call to a higher purpose. This card encourages you to make amends, seek forgiveness, and embrace new opportunities with a clear conscience.",
      "uprightMeaning": "Judgement upright represents awakening, spiritual calling, and the summons to rise to your highest potential. This is a card of reckoning—reviewing your life, making peace with the past, and being reborn into a new phase. The trumpet calls: answer your true purpose. Release guilt, embrace forgiveness (of self and others), and step into the person you are meant to become.",
      "reversedMeaning": "Judgement reversed suggests self-doubt, refusing the call to awakening, or harsh self-judgment. You may be avoiding necessary self-reflection, stuck in guilt, or unable to forgive. It can indicate a lack of self-awareness or the consequences of poor decisions catching up.",
      "symbolism": "Archangel Gabriel blows the trumpet of awakening over figures rising from coffins (resurrection, spiritual rebirth). The figures—man, woman, child—represent the family of humanity called to judgment. Mountains in the background represent the challenges overcome. The flag with a cross indicates the intersection of spirit and matter. The gray figures represent past selves being left behind.",
      "loveMeaning": "In love readings, Judgement suggests evaluating relationships honestly, forgiveness, and significant relationship decisions. It may indicate reconciliation, release of past baggage, or a relationship reaching a new level of commitment and awakening.",
      "careerMeaning": "In career readings, Judgement indicates a calling to your true vocation, career evaluations, or significant professional decisions. It suggests leaving behind work that doesn't align with your values and answering your professional calling.",
      "affirmation": "I answer my highest calling and embrace my spiritual rebirth."
    },
    "theWorld": {
      "name": "The World",
      "number": 21,
      "element": "Earth",
      "planet": "Saturn",
      "zodiacSign": "Capricorn",
      "keywords": [
        "completion",
        "integration",
        "accomplishment",
        "travel",
        "wholeness",
        "success",
        "fulfillment"
      ],
      "information": "The World represents the completion of a journey and the achievement of your goals. It signifies wholeness, integration, and a sense of fulfillment. This card encourages you to celebrate your successes and prepare for the next phase of your journey.",
      "uprightMeaning": "The World upright represents the successful completion of a major life cycle and the integration of all lessons learned. You have achieved wholeness and fulfillment. This is a moment of celebration, accomplishment, and harmony with the universe. All the elements of your life align. Before you lies the completion of the Fool's journey—and the beginning of the next adventure at a higher level.",
      "reversedMeaning": "The World reversed suggests incomplete goals, delayed success, or struggling to bring things to completion. You may be close to finishing but something holds you back. It can indicate taking shortcuts, avoiding final steps, or not feeling satisfied despite achievements.",
      "symbolism": "A figure (androgynous, representing integration of masculine/feminine) dances within an oval wreath (egg of new life, the zero of The Fool completing the cycle). Two wands represent balance of will and receptivity. The four figures at corners (lion, bull, eagle, angel) represent the four elements, fixed zodiac signs, and four evangelists. Red ribbons form an infinity symbol (eternal cycles).",
      "loveMeaning": "In love readings, The World indicates fulfilled relationships, successful unions, and the completion of romantic journeys. It can suggest marriage, commitment ceremonies, or relationships reaching a level of wholeness and harmony.",
      "careerMeaning": "In career readings, The World represents the achievement of major career goals, successful project completion, and recognition of accomplishments. It favors international work, travel, and achieving the highest level in your field.",
      "affirmation": "I celebrate my completeness and embrace the infinite cycle of growth."
    }
  },
  "minorArcana": {
    "cups": {
      "aceOfCups": {
        "name": "Ace of Cups",
        "element": "Water",
        "keywords": [
          "love",
          "new relationships",
          "compassion",
          "creativity",
          "emotional awakening"
        ],
        "information": "The Ace of Cups represents the beginning of emotional fulfillment, new relationships, and the flow of love and creativity. It signifies an outpouring of positive emotions and the potential for deep, meaningful connections.",
        "uprightMeaning": "The Ace of Cups overflows with pure emotional energy—love, compassion, and spiritual connection pour forth like water from the divine cup. A new emotional beginning is at hand: perhaps a new relationship, deepening love, creative inspiration, or spiritual awakening. Your heart opens to receive and give love freely.",
        "reversedMeaning": "Reversed, the Ace of Cups suggests blocked emotions, self-love issues, or repressed feelings. You may be closing yourself off to love or experiencing emotional emptiness. Creative blocks or spiritual disconnection may be present. Examine what is blocking your emotional flow.",
        "loveMeaning": "New love is blossoming or existing love is deepening to new levels. For singles, a significant romantic opportunity approaches. For couples, renewed emotional intimacy and deeper connection.",
        "careerMeaning": "Creative inspiration flows. New projects that feed your soul are beginning. A caring, emotionally fulfilling work environment is indicated.",
        "affirmation": "I open my heart to receive and give love abundantly."
      },
      "twoOfCups": {
        "name": "Two of Cups",
        "element": "Water",
        "keywords": [
          "unified love",
          "partnership",
          "mutual attraction",
          "connection",
          "harmony"
        ],
        "information": "The Two of Cups symbolizes harmonious partnerships and mutual attraction. It represents the balance and unity found in a loving relationship, whether romantic or platonic.",
        "uprightMeaning": "The Two of Cups represents a beautiful union of two souls—mutual attraction, respect, and emotional connection. This card indicates partnerships where both parties give and receive equally. Whether romantic, business, or friendship, this connection is blessed with harmony and understanding.",
        "reversedMeaning": "Reversed suggests imbalance in relationships, broken partnerships, or miscommunication. One person may be giving more than the other. Trust issues or falling out of love may be indicated. Seek to restore balance or recognize when partnerships no longer serve.",
        "loveMeaning": "Strong indication of mutual love, soulmate connection, or engagement. For singles, meeting someone special. For couples, recommitment and renewed romance.",
        "careerMeaning": "Successful business partnerships, beneficial collaborations, or finding a work ally who supports your growth. Harmonious working relationships.",
        "affirmation": "I attract and nurture balanced, loving connections."
      },
      "threeOfCups": {
        "name": "Three of Cups",
        "element": "Water",
        "keywords": [
          "celebration",
          "friendship",
          "creativity",
          "community",
          "joy"
        ],
        "information": "The Three of Cups signifies celebration, friendship, and joyous gatherings. It highlights the importance of social connections and creative collaborations.",
        "uprightMeaning": "The Three of Cups celebrates friendship, community, and joyful gatherings. Raise a glass to life! This card indicates celebrations, reunions, and the support of your social circle. Creative collaborations flourish. Share your happiness with others and let the good times roll.",
        "reversedMeaning": "Reversed may indicate social isolation, gossip, or overindulgence. Friendships may be strained or superficial. Third-party interference in relationships. Take care not to lose yourself in partying or to neglect important connections.",
        "loveMeaning": "Social gatherings lead to romance. Celebrating milestones with your partner. Strong friendship foundations in relationships. Beware of third parties when reversed.",
        "careerMeaning": "Team celebrations, successful group projects, and supportive work environments. Networking leads to opportunities. Creative collaborations thrive.",
        "affirmation": "I celebrate life with my beloved community."
      },
      "fourOfCups": {
        "name": "Four of Cups",
        "element": "Water",
        "keywords": [
          "meditation",
          "contemplation",
          "apathy",
          "reevaluation",
          "discontent"
        ],
        "information": "The Four of Cups represents introspection and contemplation. It suggests a period of apathy or dissatisfaction, urging reevaluation.",
        "uprightMeaning": "The Four of Cups shows someone so lost in contemplation that they miss the opportunity being offered. Apathy, boredom, or dissatisfaction with current circumstances may be causing you to overlook blessings. Step out of self-absorption and see what the universe is offering you.",
        "reversedMeaning": "Reversed indicates emerging from apathy, seeing new opportunities, or finally accepting what has been offered. Alternatively, deeper withdrawal and depression. The choice is yours—will you engage with life or continue to retreat?",
        "loveMeaning": "Taking love for granted or feeling bored in relationships. Missing romantic opportunities due to emotional unavailability. Reevaluate what you truly want.",
        "careerMeaning": "Career dissatisfaction or missing opportunities due to negativity. New offers may be overlooked. Time to reassess professional goals and attitude.",
        "affirmation": "I open my eyes to the gifts the universe offers me."
      },
      "fiveOfCups": {
        "name": "Five of Cups",
        "element": "Water",
        "keywords": ["regret", "failure", "disappointment", "grief", "loss"],
        "information": "The Five of Cups symbolizes loss, regret, and disappointment. It encourages processing grief while remembering what remains.",
        "uprightMeaning": "The Five of Cups depicts grief and disappointment—three cups have spilled, and the figure mourns their loss. Yet two cups remain standing behind them. This card acknowledges real pain but reminds you that not all is lost. Feel your grief, but eventually turn around and see what blessings remain.",
        "reversedMeaning": "Reversed indicates moving on from grief, acceptance, and recovery. You are beginning to see hope again and focus on what remains rather than what was lost. Alternatively, dwelling too long in sorrow.",
        "loveMeaning": "Heartbreak, disappointment, or mourning a relationship that did not work out. Healing from past hurts. Remember: love remains possible.",
        "careerMeaning": "Professional disappointment, failed projects, or job loss. Time to grieve but also to recognize remaining opportunities. Do not let setbacks define you.",
        "affirmation": "I honor my grief while embracing what remains."
      },
      "sixOfCups": {
        "name": "Six of Cups",
        "element": "Water",
        "keywords": [
          "nostalgia",
          "childhood memories",
          "innocence",
          "reunion",
          "past"
        ],
        "information": "The Six of Cups represents nostalgia, childhood memories, and the innocence of the past. It encourages finding joy in simple pleasures.",
        "uprightMeaning": "The Six of Cups brings sweet nostalgia and memories of simpler times. This card may indicate reconnecting with people from your past, revisiting childhood places, or rediscovering innocent joy. It also represents gifts freely given, kindness, and the pure-hearted generosity of a child.",
        "reversedMeaning": "Reversed suggests being stuck in the past, refusing to grow up, or having unresolved childhood issues. Nostalgia may be preventing forward movement. It is time to integrate the past and move into the present.",
        "loveMeaning": "Reconnecting with first love, childhood sweethearts, or past partners. Innocent, playful romance. Alternatively, past relationship patterns resurfacing.",
        "careerMeaning": "Past connections lead to opportunities. Returning to a former employer or career path. Mentoring others as you were once mentored.",
        "affirmation": "I honor my past while creating a joyful present."
      },
      "sevenOfCups": {
        "name": "Seven of Cups",
        "element": "Water",
        "keywords": [
          "opportunities",
          "choices",
          "wishful thinking",
          "illusion",
          "fantasy"
        ],
        "information": "The Seven of Cups signifies many choices and opportunities, often accompanied by confusion or wishful thinking.",
        "uprightMeaning": "The Seven of Cups presents a dazzling array of options—but are they real or illusions? This card warns against getting lost in fantasy, wishful thinking, or scattered desires. Many paths appear before you; discernment is needed to separate genuine opportunities from mirages.",
        "reversedMeaning": "Reversed indicates gaining clarity, making choices, or waking from illusion. You may be ready to commit to one path or recognize that some dreams were never meant to be. Alternatively, overwhelm and inability to choose.",
        "loveMeaning": "Many romantic options but difficulty choosing. Idealization of partners. Fantasy about love rather than reality. Time to get clear about what you truly want.",
        "careerMeaning": "Many career options causing confusion. Unrealistic expectations about success. Ground your dreams in practical action.",
        "affirmation": "I discern between fantasy and reality, choosing wisely."
      },
      "eightOfCups": {
        "name": "Eight of Cups",
        "element": "Water",
        "keywords": [
          "disappointment",
          "walking away",
          "seeking truth",
          "journey",
          "letting go"
        ],
        "information": "The Eight of Cups represents leaving behind what no longer fulfills and seeking something deeper.",
        "uprightMeaning": "The Eight of Cups shows a figure walking away from stacked cups—leaving behind something that once mattered. This card indicates the courage to abandon what no longer fulfills you in search of something deeper. It is a spiritual journey, a quest for meaning beyond material or emotional satisfaction.",
        "reversedMeaning": "Reversed suggests difficulty letting go, staying in unfulfilling situations, or fear of the unknown. You may be returning to what you left or avoiding necessary departure. Sometimes it indicates aimless wandering without purpose.",
        "loveMeaning": "Walking away from relationships that no longer serve your growth. Seeking deeper emotional connection. The courage to be alone rather than settle.",
        "careerMeaning": "Leaving unfulfilling work to search for purpose. Career transitions. Prioritizing meaning over security.",
        "affirmation": "I have the courage to seek what truly fulfills my soul."
      },
      "nineOfCups": {
        "name": "Nine of Cups",
        "element": "Water",
        "keywords": [
          "contentment",
          "satisfaction",
          "gratitude",
          "wishes fulfilled",
          "abundance"
        ],
        "information": "The Nine of Cups symbolizes emotional fulfillment, satisfaction, and wishes coming true.",
        "uprightMeaning": "The Nine of Cups is the \"wish card\"—emotional satisfaction and dreams coming true. The figure sits contentedly before nine golden cups, representing fulfilled desires. Enjoy this time of emotional abundance, gratitude, and well-being. Your wishes manifest when you align with joy.",
        "reversedMeaning": "Reversed may indicate superficial happiness, unfulfilled wishes, or wanting more despite having much. Materialism over genuine happiness. Take inventory of what truly matters.",
        "loveMeaning": "Deep romantic satisfaction and wishes for love fulfilled. Contentment in relationships. For singles, wishes for love manifesting.",
        "careerMeaning": "Career wishes coming true. Professional satisfaction and recognition. Enjoying the fruits of your labor.",
        "affirmation": "I am deeply grateful for my abundant blessings."
      },
      "tenOfCups": {
        "name": "Ten of Cups",
        "element": "Water",
        "keywords": [
          "divine love",
          "family happiness",
          "harmony",
          "completion",
          "emotional fulfillment"
        ],
        "information": "The Ten of Cups represents ultimate emotional fulfillment, family harmony, and divine love.",
        "uprightMeaning": "The Ten of Cups is the ultimate card of emotional fulfillment—a happy family beneath a rainbow of cups. This card represents lasting happiness, harmonious family life, and the achievement of your heart's deepest desires. Divine love blesses your home and relationships.",
        "reversedMeaning": "Reversed may indicate family dysfunction, broken homes, or the fairy tale falling short of reality. Perfect love may be an illusion. Work on healing family relationships or adjusting expectations.",
        "loveMeaning": "Happily ever after, marriage, family bliss, and lasting love. The relationship of your dreams manifesting in reality.",
        "careerMeaning": "Finding your career \"family,\" work-life balance, and professional fulfillment that supports home life.",
        "affirmation": "Divine love flows through my family and home."
      },
      "daughterOfCups": {
        "name": "Daughter of Cups",
        "element": "Water",
        "keywords": [
          "creative opportunities",
          "intuitive messages",
          "curiosity",
          "dreamer",
          "sensitivity"
        ],
        "information": "The Daughter of Cups symbolizes emerging creative opportunities and intuitive insights.",
        "uprightMeaning": "The Daughter of Cups is a gentle dreamer, bringing messages of love, creativity, and intuitive insights. This card represents the beginning of emotional or creative exploration—curious, open, and imaginative. Listen to your heart's quiet whispers and follow creative inspiration.",
        "reversedMeaning": "Reversed indicates emotional immaturity, blocked creativity, or ignoring intuitive messages. The dreamer may be too lost in fantasy or overly sensitive to criticism.",
        "loveMeaning": "New romantic messages or opportunities. A young, sensitive admirer. Exploring emotional depths for the first time.",
        "careerMeaning": "Creative opportunities emerging. Following artistic or intuitive callings. Messages about new emotional directions in work.",
        "affirmation": "I am open to love, creativity, and intuitive guidance."
      },
      "sonOfCups": {
        "name": "Son of Cups",
        "element": "Water",
        "keywords": ["romance", "charm", "imagination", "idealism", "artistic"],
        "information": "The Son of Cups represents the pursuit of romance, beauty, and emotional fulfillment through creative expression.",
        "uprightMeaning": "The Son of Cups is the romantic knight, following his heart with grace and charm. This card represents pursuing love and beauty, artistic expression, and emotional depth. He may indicate a romantic person in your life or the need to follow your heart's calling.",
        "reversedMeaning": "Reversed suggests moodiness, unrealistic expectations in love, or manipulation through charm. The romantic may be deceptive or emotionally unavailable.",
        "loveMeaning": "A romantic gesture or person entering your life. Following the heart. Beware of superficial charm without substance.",
        "careerMeaning": "Pursuing creative passions. Careers in arts, beauty, or emotional service. Bringing heart to your work.",
        "affirmation": "I follow my heart with grace and integrity."
      },
      "motherOfCups": {
        "name": "Mother of Cups",
        "element": "Water",
        "keywords": [
          "compassionate",
          "caring",
          "emotionally stable",
          "intuitive",
          "nurturing"
        ],
        "information": "The Mother of Cups embodies compassion, emotional stability, and deep intuition.",
        "uprightMeaning": "The Mother of Cups is the ultimate nurturer—compassionate, emotionally intelligent, and deeply intuitive. She represents emotional mastery, psychic ability, and the capacity to care for others while maintaining her own emotional well-being. Trust your intuition and lead with love.",
        "reversedMeaning": "Reversed may indicate emotional manipulation, smothering, or neglecting self-care while caring for others. Intuition may be blocked or misused. Boundaries may need attention.",
        "loveMeaning": "Deep emotional nurturing in relationships. A caring, intuitive partner. Alternatively, codependency or emotional manipulation.",
        "careerMeaning": "Careers in healing, counseling, or nurturing professions. Using emotional intelligence professionally. Creating emotionally supportive environments.",
        "affirmation": "I nurture others from a place of emotional wholeness."
      },
      "fatherOfCups": {
        "name": "Father of Cups",
        "element": "Water",
        "keywords": [
          "emotionally balanced",
          "compassionate",
          "diplomatic",
          "wise",
          "counselor"
        ],
        "information": "The Father of Cups symbolizes emotional mastery, compassion, and diplomatic wisdom.",
        "uprightMeaning": "The Father of Cups has mastered his emotions and now guides others with compassion and wisdom. He represents emotional maturity, diplomacy, and the ability to navigate complex emotional situations. This card encourages leading with heart while maintaining wise boundaries.",
        "reversedMeaning": "Reversed indicates emotional manipulation, moodiness, or using emotional intelligence for selfish ends. The wise counselor may be giving poor advice or suppressing emotions unhealthily.",
        "loveMeaning": "A wise, emotionally mature partner. Counseling relationships through difficulties. Beware of emotional control when reversed.",
        "careerMeaning": "Leadership through emotional intelligence. Counseling or advisory roles. Creating harmonious work environments.",
        "affirmation": "I lead with wisdom, compassion, and emotional mastery."
      }
    },
    "pentacles": {
      "aceOfPentacles": {
        "name": "Ace of Pentacles",
        "element": "Earth",
        "keywords": [
          "new opportunity",
          "manifestation",
          "abundance",
          "prosperity",
          "new beginnings"
        ],
        "information": "The Ace of Pentacles represents the beginning of new financial or career opportunities with potential for prosperity and abundance.",
        "uprightMeaning": "The Ace of Pentacles offers a golden opportunity—new financial beginnings, career advancement, or the seed of material success. A hand emerges from the clouds offering a pentacle, representing divine gifts of abundance. This is the time to plant seeds for future prosperity through practical action.",
        "reversedMeaning": "Reversed indicates missed opportunities, poor financial planning, or lack of follow-through. Material goals may be blocked or delayed. Examine what is preventing you from manifesting abundance.",
        "loveMeaning": "Stable new relationship with long-term potential. Building a solid foundation for love. Practical expressions of affection.",
        "careerMeaning": "New job opportunity, promotion, or business venture. Financial improvement. Time to invest in career development.",
        "affirmation": "I am open to receiving abundance in all forms."
      },
      "twoOfPentacles": {
        "name": "Two of Pentacles",
        "element": "Earth",
        "keywords": [
          "balance",
          "adaptability",
          "time management",
          "juggling",
          "flexibility"
        ],
        "information": "The Two of Pentacles symbolizes juggling multiple responsibilities and the need for adaptability and balance.",
        "uprightMeaning": "The Two of Pentacles shows skillful juggling of multiple priorities—work and life, money and time, various responsibilities. The infinity symbol around the pentacles shows the eternal dance of balance. Stay flexible, adapt to changing circumstances, and keep all balls in the air.",
        "reversedMeaning": "Reversed indicates overwhelm, dropped responsibilities, or poor time management. Balance is lost. Simplify and prioritize before everything collapses.",
        "loveMeaning": "Balancing relationship with other life demands. Juggling multiple romantic interests. Need for flexibility in partnerships.",
        "careerMeaning": "Multitasking at work. Managing multiple projects or jobs. Adaptability to changing work conditions.",
        "affirmation": "I gracefully balance all aspects of my life."
      },
      "threeOfPentacles": {
        "name": "Three of Pentacles",
        "element": "Earth",
        "keywords": [
          "teamwork",
          "collaboration",
          "mastery",
          "learning",
          "building"
        ],
        "information": "The Three of Pentacles represents teamwork, skill development, and the value of collaborative effort.",
        "uprightMeaning": "The Three of Pentacles celebrates skilled work and collaboration. A craftsman works on a cathedral while experts consult—representing the value of combining talents. This card indicates learning, skill development, and the recognition that great things are built through teamwork.",
        "reversedMeaning": "Reversed suggests lack of teamwork, sloppy work, or unappreciated efforts. Conflict within teams. Learning may be blocked or skills undervalued.",
        "loveMeaning": "Working together to build relationship. Collaborative approach to partnership. Learning to be a better partner.",
        "careerMeaning": "Successful teamwork, professional development, and recognition for skills. Quality work leads to advancement.",
        "affirmation": "I contribute my skills while honoring others' expertise."
      },
      "fourOfPentacles": {
        "name": "Four of Pentacles",
        "element": "Earth",
        "keywords": [
          "security",
          "control",
          "conservatism",
          "saving",
          "boundaries"
        ],
        "information": "The Four of Pentacles symbolizes financial security, conservation of resources, and the need for healthy boundaries.",
        "uprightMeaning": "The Four of Pentacles shows tight grip on resources—security through careful management. This card indicates saving, protecting what you have, and establishing boundaries. Positively: financial prudence. Negatively: fear of loss, hoarding, or being overly controlling.",
        "reversedMeaning": "Reversed may indicate letting go of control, spending freely, or financial insecurity. Either generosity flows or resources slip through fingers carelessly.",
        "loveMeaning": "Holding too tightly in relationships. Fear of loss causing control issues. Alternatively, opening up emotionally after guarding your heart.",
        "careerMeaning": "Financial security through careful planning. Resistance to change at work. Protecting your position or resources.",
        "affirmation": "I balance security with generous flow."
      },
      "fiveOfPentacles": {
        "name": "Five of Pentacles",
        "element": "Earth",
        "keywords": ["hardship", "loss", "isolation", "worry", "adversity"],
        "information": "The Five of Pentacles represents financial hardship, material loss, and feelings of isolation during difficult times.",
        "uprightMeaning": "The Five of Pentacles depicts figures in cold and poverty, passing a lit church window. This card indicates financial hardship, material loss, or feeling left out in the cold. Yet help is available—the lit window suggests support exists if you seek it. Do not let pride prevent you from asking for assistance.",
        "reversedMeaning": "Reversed indicates recovery from hardship, accepting help, or seeing the end of difficult times. Alternatively, deeper isolation or refusal to seek support.",
        "loveMeaning": "Relationship difficulties, feeling abandoned, or financial strain affecting partnership. Seeking support together through hard times.",
        "careerMeaning": "Job loss, financial difficulties, or professional setbacks. Help is available through networking and perseverance.",
        "affirmation": "Even in hardship, I seek and accept support."
      },
      "sixOfPentacles": {
        "name": "Six of Pentacles",
        "element": "Earth",
        "keywords": ["generosity", "charity", "giving", "receiving", "balance"],
        "information": "The Six of Pentacles symbolizes the balance of giving and receiving, generosity, and acts of charity.",
        "uprightMeaning": "The Six of Pentacles shows a wealthy figure giving to those in need—the balance of giving and receiving. This card indicates generosity, charity, and the flow of resources. You may be in position to give or in need of receiving. Either role is honored when done with grace.",
        "reversedMeaning": "Reversed suggests strings attached to gifts, one-sided generosity, or abuse of charity. Examine the true motivations behind giving and receiving.",
        "loveMeaning": "Balance in giving and receiving love. Generosity in relationships. Beware of power imbalances when reversed.",
        "careerMeaning": "Receiving help or recognition. Being in position to support colleagues. Mentorship and sharing resources.",
        "affirmation": "I give and receive with equal grace."
      },
      "sevenOfPentacles": {
        "name": "Seven of Pentacles",
        "element": "Earth",
        "keywords": [
          "patience",
          "investment",
          "long-term view",
          "perseverance",
          "assessment"
        ],
        "information": "The Seven of Pentacles represents patience, long-term planning, and evaluation of investments.",
        "uprightMeaning": "The Seven of Pentacles shows a gardener surveying crops not yet ready for harvest. This card indicates patience, long-term investment, and evaluating progress. Sometimes you must wait for results. Assess whether your efforts are directed wisely and adjust as needed.",
        "reversedMeaning": "Reversed suggests impatience, poor investments, or lack of growth despite effort. Time to reassess whether this path is worth continuing.",
        "loveMeaning": "Evaluating relationship progress. Patience in developing love. Questioning whether partnership is growing.",
        "careerMeaning": "Assessing career progress. Long-term professional planning. Patience while building toward goals.",
        "affirmation": "I trust in the timing of my harvest."
      },
      "eightOfPentacles": {
        "name": "Eight of Pentacles",
        "element": "Earth",
        "keywords": [
          "mastery",
          "skill development",
          "diligence",
          "apprenticeship",
          "dedication"
        ],
        "information": "The Eight of Pentacles symbolizes dedicated practice, skill mastery, and commitment to excellence.",
        "uprightMeaning": "The Eight of Pentacles shows an artisan meticulously crafting pentacles—mastery through dedicated practice. This card indicates skill development, apprenticeship, and the commitment to excellence. Keep working at your craft; expertise comes through patient, focused effort.",
        "reversedMeaning": "Reversed suggests shortcuts, shoddy work, or lack of dedication. Skills may plateau without proper attention. Perfectionism may cause paralysis.",
        "loveMeaning": "Working on relationship skills. Dedication to being a better partner. Crafting love with care and attention.",
        "careerMeaning": "Professional development and training. Mastery of skills leads to success. Focused work ethic appreciated.",
        "affirmation": "I commit to excellence through dedicated practice."
      },
      "nineOfPentacles": {
        "name": "Nine of Pentacles",
        "element": "Earth",
        "keywords": [
          "abundance",
          "luxury",
          "self-sufficiency",
          "independence",
          "accomplishment"
        ],
        "information": "The Nine of Pentacles represents self-sufficiency, enjoying abundance, and the rewards of disciplined effort.",
        "uprightMeaning": "The Nine of Pentacles shows a elegant figure in a lush garden—self-made success and refined enjoyment. This card indicates financial independence, luxury earned through effort, and the pleasure of accomplishment. Enjoy what you have created; you deserve this abundance.",
        "reversedMeaning": "Reversed may indicate financial dependence, superficial success, or overwork at the expense of enjoyment. Material success without inner fulfillment.",
        "loveMeaning": "Independence in love. Self-sufficient partnership. Attracting love through self-worth rather than need.",
        "careerMeaning": "Career success and financial rewards. Self-employment success. Enjoying professional accomplishments.",
        "affirmation": "I deserve the abundance I have created."
      },
      "tenOfPentacles": {
        "name": "Ten of Pentacles",
        "element": "Earth",
        "keywords": [
          "legacy",
          "inheritance",
          "family wealth",
          "establishment",
          "tradition"
        ],
        "information": "The Ten of Pentacles symbolizes generational wealth, family legacy, and long-term stability.",
        "uprightMeaning": "The Ten of Pentacles represents ultimate material success—wealth that spans generations. This card indicates family prosperity, inheritance, and the establishment of lasting security. Focus on what you are building for future generations and the traditions you are creating.",
        "reversedMeaning": "Reversed suggests family financial disputes, squandered inheritance, or prioritizing money over family bonds. The legacy may be unstable.",
        "loveMeaning": "Family approval of relationship. Building toward marriage and family. Generational patterns in love.",
        "careerMeaning": "Family business, long-term career stability, and retirement planning. Building professional legacy.",
        "affirmation": "I build lasting prosperity for generations."
      },
      "daughterOfPentacles": {
        "name": "Daughter of Pentacles",
        "element": "Earth",
        "keywords": [
          "manifestation",
          "opportunity",
          "student",
          "practicality",
          "nature"
        ],
        "information": "The Daughter of Pentacles represents new practical opportunities and the beginning of material development.",
        "uprightMeaning": "The Daughter of Pentacles studies her pentacle with wonder—new opportunities for material growth are emerging. This card indicates practical learning, financial messages, and the beginning of prosperity. Stay grounded while nurturing new possibilities.",
        "reversedMeaning": "Reversed suggests procrastination, missed opportunities, or impractical approaches to material matters. Ground dreams in reality.",
        "loveMeaning": "New relationship with practical potential. Learning about love. Messages about partnership opportunities.",
        "careerMeaning": "New job opportunities, scholarships, or skill development. Messages about financial matters.",
        "affirmation": "I nurture new opportunities with practical care."
      },
      "sonOfPentacles": {
        "name": "Son of Pentacles",
        "element": "Earth",
        "keywords": [
          "hard work",
          "routine",
          "methodical",
          "patience",
          "reliability"
        ],
        "information": "The Son of Pentacles symbolizes steady progress through diligent, methodical effort.",
        "uprightMeaning": "The Son of Pentacles rides slowly on a steady horse—patience and methodical progress. This card indicates hard work, routine, and reliable advancement. Success comes not through speed but through consistent, quality effort.",
        "reversedMeaning": "Reversed suggests laziness, impatience, or being stuck in unfulfilling routine. The slow pace may feel frustrating.",
        "loveMeaning": "Patient courtship. Reliable, steady partner. Slow-building but lasting love.",
        "careerMeaning": "Steady career progress through hard work. Methodical approach to professional development.",
        "affirmation": "Steady effort builds lasting success."
      },
      "motherOfPentacles": {
        "name": "Mother of Pentacles",
        "element": "Earth",
        "keywords": [
          "nurturing",
          "practical",
          "abundance",
          "provider",
          "nature"
        ],
        "information": "The Mother of Pentacles embodies practical nurturing and the ability to create abundance.",
        "uprightMeaning": "The Mother of Pentacles nurtures abundance in her garden—practical care creates material security. This card represents the ability to provide while nurturing, balancing work and home, and creating comfortable, prosperous environments.",
        "reversedMeaning": "Reversed may indicate neglecting home for work (or vice versa), smothering with material things, or financial mismanagement in family matters.",
        "loveMeaning": "Nurturing, practical partner. Creating comfortable home together. Balancing love with practical responsibilities.",
        "careerMeaning": "Work-life balance. Nurturing work environment. Practical management and leadership.",
        "affirmation": "I create abundance through loving, practical care."
      },
      "fatherOfPentacles": {
        "name": "Father of Pentacles",
        "element": "Earth",
        "keywords": ["wealth", "security", "ambition", "provider", "success"],
        "information": "The Father of Pentacles symbolizes material mastery, business success, and responsible wealth management.",
        "uprightMeaning": "The Father of Pentacles sits on a throne adorned with bulls, surrounded by abundance—he has mastered the material world. This card indicates business success, financial security, and the wisdom to manage wealth responsibly. A reliable provider and steady leader.",
        "reversedMeaning": "Reversed suggests workaholism, materialism without soul, or financial mismanagement. Success at the cost of relationships or values.",
        "loveMeaning": "Stable, providing partner. Material security in relationships. Beware of substituting money for emotional connection.",
        "careerMeaning": "Business success, financial mastery, and responsible leadership. Long-term career achievement.",
        "affirmation": "I master the material world with wisdom and integrity."
      }
    },
    "swords": {
      "aceOfSwords": {
        "name": "Ace of Swords",
        "element": "Air",
        "keywords": [
          "clarity",
          "breakthrough",
          "truth",
          "new ideas",
          "mental force"
        ],
        "information": "The Ace of Swords represents mental clarity, new ideas, and the power to cut through confusion to truth.",
        "uprightMeaning": "The Ace of Swords pierces through clouds—breakthrough and mental clarity are at hand. This card represents new ideas, truth revealed, and the intellectual force needed to cut through confusion. Seize this moment of mental power; clarity leads to victory.",
        "reversedMeaning": "Reversed indicates confusion, miscommunication, or the misuse of intellect. Truth may be distorted. Mental fog or using sharp words to wound.",
        "loveMeaning": "Clear communication in relationships. Honest conversations about feelings. Cutting through relationship confusion.",
        "careerMeaning": "Breakthrough ideas, clear thinking in professional matters, and intellectual success. Truth wins in conflicts.",
        "affirmation": "I cut through confusion with clarity and truth."
      },
      "twoOfSwords": {
        "name": "Two of Swords",
        "element": "Air",
        "keywords": [
          "indecision",
          "stalemate",
          "difficult choices",
          "denial",
          "balance"
        ],
        "information": "The Two of Swords symbolizes difficult decisions, avoidance, and the need to confront blocked situations.",
        "uprightMeaning": "The Two of Swords shows a blindfolded figure balancing crossed swords—refusing to see or decide. This card indicates stalemate, difficult choices, and avoidance. The truth must be faced, and a decision must be made. Remove the blindfold.",
        "reversedMeaning": "Reversed may indicate making a difficult decision, removing barriers to choice, or information finally becoming clear. Alternatively, deeper denial.",
        "loveMeaning": "Avoiding difficult conversations in relationships. Indecision about commitment. Time to face relationship truths.",
        "careerMeaning": "Career crossroads requiring difficult choices. Workplace conflicts needing resolution. Breaking through professional stalemates.",
        "affirmation": "I face difficult truths and make clear decisions."
      },
      "threeOfSwords": {
        "name": "Three of Swords",
        "element": "Air",
        "keywords": ["heartbreak", "grief", "sorrow", "pain", "separation"],
        "information": "The Three of Swords represents heartbreak, emotional pain, and the necessity of processing grief.",
        "uprightMeaning": "The Three of Swords pierces a heart with three blades—heartbreak, sorrow, and emotional pain. This card indicates grief, loss, and painful truth. The heart must break open for healing to begin. Acknowledge the pain; suppressing it only prolongs suffering.",
        "reversedMeaning": "Reversed suggests healing from heartbreak, releasing grief, or coming to terms with loss. Alternatively, deeper pain or refusing to acknowledge hurt.",
        "loveMeaning": "Heartbreak, separation, or painful revelations in love. Necessary grief that leads to healing.",
        "careerMeaning": "Professional disappointment, painful truth about work, or difficult separations from colleagues or positions.",
        "affirmation": "I allow my heart to break open for healing."
      },
      "fourOfSwords": {
        "name": "Four of Swords",
        "element": "Air",
        "keywords": ["rest", "recovery", "contemplation", "retreat", "peace"],
        "information": "The Four of Swords symbolizes rest, recuperation, and the need for mental peace after stress.",
        "uprightMeaning": "The Four of Swords shows a knight at rest in a chapel—recovery and contemplation after battle. This card indicates the need for rest, retreat, and mental recuperation. Step back from stress; healing requires stillness and peace.",
        "reversedMeaning": "Reversed suggests restlessness, burnout, or refusal to rest. Alternatively, emerging from a period of recovery ready for action.",
        "loveMeaning": "Taking space in relationships for self-reflection. Rest from relationship stress. Healing time.",
        "careerMeaning": "Need for vacation or mental health break. Recovery from work stress. Contemplating next career moves.",
        "affirmation": "I honor my need for rest and recovery."
      },
      "fiveOfSwords": {
        "name": "Five of Swords",
        "element": "Air",
        "keywords": [
          "conflict",
          "defeat",
          "winning at all costs",
          "hostility",
          "loss"
        ],
        "information": "The Five of Swords represents conflict, hollow victory, and the costs of winning at all costs.",
        "uprightMeaning": "The Five of Swords shows a victor collecting swords while others walk away defeated. This card indicates conflict, competition, and winning at all costs—but at what price? The victory may be hollow. Consider whether the battle is worth the cost to relationships and reputation.",
        "reversedMeaning": "Reversed suggests reconciliation after conflict, accepting defeat gracefully, or ending hostilities. Alternatively, ongoing resentment and grudges.",
        "loveMeaning": "Conflict in relationships, power struggles, or feeling defeated in love. Time to end the war or accept losses.",
        "careerMeaning": "Workplace conflicts, competition gone too far, or Pyrrhic victories. Weigh the costs of winning.",
        "affirmation": "I choose battles wisely and seek honorable resolution."
      },
      "sixOfSwords": {
        "name": "Six of Swords",
        "element": "Air",
        "keywords": [
          "transition",
          "moving on",
          "leaving behind",
          "journey",
          "healing"
        ],
        "information": "The Six of Swords symbolizes transition, moving away from difficulty, and the journey toward healing.",
        "uprightMeaning": "The Six of Swords shows a boat carrying passengers from rough to calm waters—transition and moving on. This card indicates leaving difficulties behind, necessary transitions, and the journey toward peace. Though the journey may be somber, calmer waters lie ahead.",
        "reversedMeaning": "Reversed suggests inability to move on, returning to old difficulties, or delayed transitions. The journey may be blocked or circular.",
        "loveMeaning": "Moving on from relationship difficulties. Transitioning out of troubled partnerships. Healing journey in love.",
        "careerMeaning": "Career transition, leaving toxic work environments, or moving toward more peaceful professional waters.",
        "affirmation": "I move forward toward calmer waters."
      },
      "sevenOfSwords": {
        "name": "Seven of Swords",
        "element": "Air",
        "keywords": ["deception", "strategy", "stealth", "betrayal", "cunning"],
        "information": "The Seven of Swords represents strategy, deception, and the need for careful, sometimes covert action.",
        "uprightMeaning": "The Seven of Swords shows a figure sneaking away with stolen swords—strategy, deception, or getting away with something. This card indicates cunning action, sometimes necessary and sometimes unethical. Be aware of deception around you, or examine your own motivations for secretive behavior.",
        "reversedMeaning": "Reversed suggests being caught in deception, conscience about dishonesty, or someone's true colors being revealed. Time for truth.",
        "loveMeaning": "Secrets or deception in relationships. Hidden agendas. Need for honesty or uncovering partner's truth.",
        "careerMeaning": "Strategic maneuvering at work, office politics, or dishonesty in business. Protect yourself while staying ethical.",
        "affirmation": "I act strategically while honoring my integrity."
      },
      "eightOfSwords": {
        "name": "Eight of Swords",
        "element": "Air",
        "keywords": [
          "restriction",
          "imprisonment",
          "victim mentality",
          "self-limiting",
          "trapped"
        ],
        "information": "The Eight of Swords symbolizes mental imprisonment, self-imposed restrictions, and the power of limiting beliefs.",
        "uprightMeaning": "The Eight of Swords shows a bound and blindfolded figure surrounded by swords—yet the bonds are loose and escape is possible. This card indicates feeling trapped by circumstances or thoughts that are actually self-imposed. Your prison exists primarily in your mind. Remove the blindfold and see freedom is closer than you think.",
        "reversedMeaning": "Reversed suggests breaking free from mental prison, releasing limiting beliefs, or finally seeing a way out. Liberation from self-imposed restrictions.",
        "loveMeaning": "Feeling trapped in relationship patterns. Self-limiting beliefs about love. Recognizing you have more options than you see.",
        "careerMeaning": "Feeling stuck in career, self-imposed professional limitations, or breaking free from restrictive work situations.",
        "affirmation": "I release the mental bonds that imprison me."
      },
      "nineOfSwords": {
        "name": "Nine of Swords",
        "element": "Air",
        "keywords": [
          "anxiety",
          "nightmares",
          "worry",
          "fear",
          "mental anguish"
        ],
        "information": "The Nine of Swords represents anxiety, nightmares, and mental anguish, often worse than reality warrants.",
        "uprightMeaning": "The Nine of Swords shows a figure waking from nightmare, head in hands—anxiety, fear, and mental anguish. This card indicates worry that keeps you up at night, often worse than reality warrants. The nine swords represent thoughts, not facts. Much of what you fear may never come to pass.",
        "reversedMeaning": "Reversed may indicate releasing anxiety, finding peace after worry, or finally addressing fears. Alternatively, inner turmoil hidden from others.",
        "loveMeaning": "Anxiety about relationships, fears about love, or nightmares about partnership. Often the worry exceeds the reality.",
        "careerMeaning": "Work-related stress causing sleepless nights. Professional anxiety. Time to address fears or recognize they are overblown.",
        "affirmation": "I release anxiety and trust in peaceful resolution."
      },
      "tenOfSwords": {
        "name": "Ten of Swords",
        "element": "Air",
        "keywords": ["ending", "betrayal", "crisis", "rock bottom", "new dawn"],
        "information": "The Ten of Swords represents painful endings, rock bottom, but also the dawn of new beginnings after crisis.",
        "uprightMeaning": "The Ten of Swords shows a figure with ten swords in their back—but dawn breaks on the horizon. This card indicates painful endings, rock bottom, and the culmination of crisis. Yet it cannot get worse; the only way is up. Accept the ending; the worst is behind you, and new light approaches.",
        "reversedMeaning": "Reversed suggests recovery from crisis, resisting inevitable endings, or slowly healing from deep wounds. The darkest hour is passing.",
        "loveMeaning": "Painful relationship endings, betrayal, or reaching the lowest point in love. Yet healing and new love can follow.",
        "careerMeaning": "Career crisis, professional betrayal, or hitting rock bottom at work. The only way is up from here.",
        "affirmation": "Even at rock bottom, I see the dawn approaching."
      },
      "daughterOfSwords": {
        "name": "Daughter of Swords",
        "element": "Air",
        "keywords": [
          "curiosity",
          "new ideas",
          "truth-seeking",
          "communication",
          "vigilance"
        ],
        "information": "The Daughter of Swords represents intellectual curiosity, new ways of thinking, and messages of truth.",
        "uprightMeaning": "The Daughter of Swords holds her sword high, ready for truth—intellectual curiosity and new ways of thinking are emerging. This card indicates messages, new ideas, and the beginning of mental endeavors. Stay alert and vigilant; truth is seeking to be discovered.",
        "reversedMeaning": "Reversed suggests scattered thoughts, gossip, or using intellect unwisely. Messages may be misleading or communication problematic.",
        "loveMeaning": "New communications about love, truth-seeking in relationships, or a young, intellectually curious admirer.",
        "careerMeaning": "News about work, intellectual opportunities, or beginning of new mental challenges. Stay sharp.",
        "affirmation": "I seek truth with sharp, curious intellect."
      },
      "sonOfSwords": {
        "name": "Son of Swords",
        "element": "Air",
        "keywords": ["action", "ambition", "drive", "assertive", "hasty"],
        "information": "The Son of Swords symbolizes swift action, ambitious pursuit of goals, and sometimes hasty decisions.",
        "uprightMeaning": "The Son of Swords charges forward on his horse—swift action, ambition, and fearless pursuit of goals. This card indicates driving forward with mental energy, tackling challenges head-on, and fast-paced change. Act decisively, but avoid reckless haste.",
        "reversedMeaning": "Reversed suggests recklessness, all talk and no action, or scattered energy. Hasty decisions may cause problems.",
        "loveMeaning": "Fast-moving romance, assertive pursuit of love, or rushing into relationships. Slow down if needed.",
        "careerMeaning": "Ambitious career moves, fast-paced professional action, or driving toward goals with determination.",
        "affirmation": "I act swiftly and decisively toward my goals."
      },
      "motherOfSwords": {
        "name": "Mother of Swords",
        "element": "Air",
        "keywords": [
          "independent",
          "perceptive",
          "clear boundaries",
          "truth",
          "direct"
        ],
        "information": "The Mother of Swords embodies independence, clear perception, and direct communication of truth.",
        "uprightMeaning": "The Mother of Swords sits on her throne, sword raised, seeing clearly—independent judgment and direct truth. This card represents the ability to perceive situations clearly, set strong boundaries, and communicate with precision. She speaks truth without cruelty but without softening it either.",
        "reversedMeaning": "Reversed may indicate coldness, cruelty with words, or harsh judgment. Alternatively, not speaking truth when needed.",
        "loveMeaning": "Clear boundaries in relationships, direct communication about needs, or an independent partner. Beware of coldness.",
        "careerMeaning": "Direct professional communication, clear judgment in work matters, and boundary-setting with colleagues.",
        "affirmation": "I speak truth clearly while respecting others."
      },
      "fatherOfSwords": {
        "name": "Father of Swords",
        "element": "Air",
        "keywords": [
          "authority",
          "truth",
          "intellectual power",
          "justice",
          "clarity"
        ],
        "information": "The Father of Swords symbolizes intellectual mastery, authority based on truth, and the power of clear judgment.",
        "uprightMeaning": "The Father of Swords commands from his throne—intellectual authority and mastery of truth. This card represents the power to discern clearly, judge fairly, and communicate with authority. He leads with mind rather than heart, sometimes to the point of coldness, but always with clarity.",
        "reversedMeaning": "Reversed indicates abuse of intellectual power, manipulation through logic, or tyrannical authority. Cold judgment without compassion.",
        "loveMeaning": "Intellectual partner, clear communication in relationships, or analyzing love logically. Beware of emotional disconnect.",
        "careerMeaning": "Authority through expertise, leadership requiring clear judgment, and mastery of professional domain.",
        "affirmation": "I lead with clarity, truth, and fair judgment."
      }
    },
    "wands": {
      "aceOfWands": {
        "name": "Ace of Wands",
        "element": "Fire",
        "keywords": [
          "inspiration",
          "new beginnings",
          "creativity",
          "potential",
          "spark"
        ],
        "information": "The Ace of Wands represents the spark of inspiration, creative potential, and new beginnings filled with passionate energy.",
        "uprightMeaning": "The Ace of Wands bursts forth with creative fire—inspiration, new beginnings, and raw potential. A hand holds a blossoming wand, representing the seed of a passionate venture. This is the spark that starts the fire. Seize this creative energy and channel it into action.",
        "reversedMeaning": "Reversed indicates creative blocks, false starts, or lack of direction. The spark may be present but not catching fire. Examine what is blocking your creative flow.",
        "loveMeaning": "New passionate romance, creative approach to love, or spark of attraction. Exciting new beginnings in relationships.",
        "careerMeaning": "Inspiring new project, creative venture, or entrepreneurial spark. Time to pursue passionate work.",
        "affirmation": "I ignite my creative potential with passionate action."
      },
      "twoOfWands": {
        "name": "Two of Wands",
        "element": "Fire",
        "keywords": [
          "planning",
          "decisions",
          "discovery",
          "future vision",
          "progress"
        ],
        "information": "The Two of Wands symbolizes planning for the future, making decisions about direction, and holding the world in your hands.",
        "uprightMeaning": "The Two of Wands shows a figure holding the world, looking out from a castle—planning, decisions, and future vision. The initial spark has caught; now comes strategic thinking about where to direct your fire. The world awaits; choose your direction wisely.",
        "reversedMeaning": "Reversed indicates fear of the unknown, poor planning, or lacking vision. You may be staying in your comfort zone rather than expanding.",
        "loveMeaning": "Planning future with partner, deciding about relationship direction, or considering romantic options.",
        "careerMeaning": "Career planning, considering opportunities, and strategic professional thinking. The world is open to you.",
        "affirmation": "I plan my future with vision and strategic purpose."
      },
      "threeOfWands": {
        "name": "Three of Wands",
        "element": "Fire",
        "keywords": [
          "expansion",
          "foresight",
          "progress",
          "overseas",
          "growth"
        ],
        "information": "The Three of Wands represents expansion, watching plans unfold, and opportunities arriving from afar.",
        "uprightMeaning": "The Three of Wands shows a figure watching ships approach—plans are unfolding, expansion is underway. This card indicates progress, foresight paying off, and opportunities arriving. Your efforts are beginning to bear fruit; continue to think big.",
        "reversedMeaning": "Reversed suggests delays in plans, obstacles to expansion, or disappointing returns on efforts. Patience may be needed.",
        "loveMeaning": "Relationship expansion, long-distance love, or watching partnership grow. Planning future together.",
        "careerMeaning": "Business expansion, international opportunities, and watching career plans unfold successfully.",
        "affirmation": "My vision expands as opportunities arrive."
      },
      "fourOfWands": {
        "name": "Four of Wands",
        "element": "Fire",
        "keywords": [
          "celebration",
          "harmony",
          "milestone",
          "homecoming",
          "community"
        ],
        "information": "The Four of Wands symbolizes celebration, achievement of milestones, and joyous community gatherings.",
        "uprightMeaning": "The Four of Wands depicts celebration under a flower-adorned canopy—milestones achieved, community gathered in joy. This card indicates celebration, harmony, and the happiness of homecoming. Take time to celebrate your achievements with loved ones.",
        "reversedMeaning": "Reversed may indicate cancelled celebrations, lack of harmony, or feeling like an outsider. Home life may need attention.",
        "loveMeaning": "Relationship milestones, engagement, wedding celebration, or joyous partnership achievements.",
        "careerMeaning": "Work celebrations, team achievements, and professional milestones worthy of recognition.",
        "affirmation": "I celebrate my achievements with joyous community."
      },
      "fiveOfWands": {
        "name": "Five of Wands",
        "element": "Fire",
        "keywords": [
          "conflict",
          "competition",
          "disagreement",
          "challenge",
          "rivalry"
        ],
        "information": "The Five of Wands represents conflict, competition, and the challenges of working with diverse perspectives.",
        "uprightMeaning": "The Five of Wands shows figures in chaotic combat—conflict, competition, and clashing egos. This card indicates disagreement, rivalry, and the struggle of diverse opinions. While challenging, this competition can sharpen your skills. Channel the energy constructively.",
        "reversedMeaning": "Reversed suggests conflict resolution, avoiding confrontation, or internal rather than external struggle. Peace may be possible.",
        "loveMeaning": "Relationship conflicts, competing for attention, or power struggles in partnership. Work toward resolution.",
        "careerMeaning": "Workplace competition, conflicting ideas, and professional rivalry. Stand your ground while remaining collaborative.",
        "affirmation": "I navigate conflict constructively and grow stronger."
      },
      "sixOfWands": {
        "name": "Six of Wands",
        "element": "Fire",
        "keywords": [
          "victory",
          "recognition",
          "success",
          "acclaim",
          "achievement"
        ],
        "information": "The Six of Wands symbolizes victory, public recognition, and the celebration of achievement.",
        "uprightMeaning": "The Six of Wands shows a victor on horseback, crowned with laurels, celebrated by crowds—victory and public recognition. This card indicates success, acclaim, and the sweet taste of achievement. Your efforts are recognized; accept the praise graciously.",
        "reversedMeaning": "Reversed suggests lack of recognition, hollow victory, or fall from grace. Success may be delayed or unacknowledged.",
        "loveMeaning": "Relationship success, feeling victorious in love, or public celebration of partnership.",
        "careerMeaning": "Professional recognition, career victory, and public acclaim for achievements. Success is celebrated.",
        "affirmation": "I accept recognition for my achievements with grace."
      },
      "sevenOfWands": {
        "name": "Seven of Wands",
        "element": "Fire",
        "keywords": [
          "defense",
          "perseverance",
          "standing ground",
          "competition",
          "challenge"
        ],
        "information": "The Seven of Wands represents defending your position, standing your ground against opposition, and perseverance.",
        "uprightMeaning": "The Seven of Wands shows a figure defending high ground against attackers—standing firm under pressure. This card indicates the need to defend your position, persevere against opposition, and maintain your ground. You have the advantage; do not give it up.",
        "reversedMeaning": "Reversed suggests giving up, being overwhelmed by opposition, or choosing not to fight. Sometimes retreat is wisdom.",
        "loveMeaning": "Defending relationship, fighting for love, or standing ground on relationship values.",
        "careerMeaning": "Defending professional position, workplace challenges, and perseverance against competition.",
        "affirmation": "I stand my ground with courage and conviction."
      },
      "eightOfWands": {
        "name": "Eight of Wands",
        "element": "Fire",
        "keywords": ["speed", "action", "movement", "progress", "momentum"],
        "information": "The Eight of Wands symbolizes rapid movement, swift progress, and things moving quickly toward completion.",
        "uprightMeaning": "The Eight of Wands shows wands flying through clear sky—rapid movement and swift progress. This card indicates things moving quickly, momentum building, and actions bearing fruit fast. Strike while the iron is hot; delays are over.",
        "reversedMeaning": "Reversed suggests delays, miscommunication, or arrows falling short. Momentum may be blocked or scattered.",
        "loveMeaning": "Fast-moving romance, travel for love, or rapid developments in relationships.",
        "careerMeaning": "Swift career progress, quick turnaround on projects, and momentum in professional matters.",
        "affirmation": "I move swiftly toward my goals with clear direction."
      },
      "nineOfWands": {
        "name": "Nine of Wands",
        "element": "Fire",
        "keywords": [
          "resilience",
          "persistence",
          "courage",
          "last stand",
          "boundaries"
        ],
        "information": "The Nine of Wands represents resilience, courage in the face of adversity, and persistence near the finish line.",
        "uprightMeaning": "The Nine of Wands shows a wounded figure still standing guard—resilience after battle, persistence despite weariness. This card indicates you are near the end but must stay strong. One more challenge remains; do not give up now. Protect your boundaries.",
        "reversedMeaning": "Reversed suggests exhaustion, giving up too soon, or stubbornness. Know when to rest and when to release.",
        "loveMeaning": "Persisting in love despite challenges, protecting relationship boundaries, or feeling battle-weary in partnership.",
        "careerMeaning": "Career resilience, persistence near goals, and maintaining professional boundaries under pressure.",
        "affirmation": "I persist with courage; the finish line is near."
      },
      "tenOfWands": {
        "name": "Ten of Wands",
        "element": "Fire",
        "keywords": [
          "burden",
          "responsibility",
          "hard work",
          "stress",
          "completion"
        ],
        "information": "The Ten of Wands symbolizes heavy burdens, overwhelming responsibility, and the weight of success.",
        "uprightMeaning": "The Ten of Wands shows a figure bent under the weight of ten heavy wands—burden, responsibility, and hard work. This card indicates carrying too much, feeling overwhelmed by obligations, or success creating new burdens. Delegate or release what you can; the load is too heavy.",
        "reversedMeaning": "Reversed suggests releasing burdens, learning to delegate, or collapse under weight. Time to set things down.",
        "loveMeaning": "Relationship burdens, carrying too much for partner, or overwhelmed by love responsibilities.",
        "careerMeaning": "Work overload, taking on too much responsibility, and career stress from success.",
        "affirmation": "I release what I cannot carry and accept help."
      },
      "daughterOfWands": {
        "name": "Daughter of Wands",
        "element": "Fire",
        "keywords": [
          "exploration",
          "excitement",
          "free spirit",
          "discovery",
          "enthusiasm"
        ],
        "information": "The Daughter of Wands represents the spark of adventure, enthusiastic new beginnings, and free-spirited exploration.",
        "uprightMeaning": "The Daughter of Wands gazes at her wand with wonder and excitement—new adventures, enthusiastic beginnings, and free-spirited exploration. This card indicates messages of inspiration, the beginning of passionate ventures, and youthful excitement for life.",
        "reversedMeaning": "Reversed suggests scattered energy, blocked creativity, or lack of direction. The enthusiasm may be unfocused.",
        "loveMeaning": "Exciting new romantic interest, adventurous approach to love, or passionate messages about relationships.",
        "careerMeaning": "Inspiring new project, creative opportunity, or enthusiastic beginning of career venture.",
        "affirmation": "I embrace adventure with enthusiasm and wonder."
      },
      "sonOfWands": {
        "name": "Son of Wands",
        "element": "Fire",
        "keywords": [
          "adventure",
          "passion",
          "action",
          "impulsiveness",
          "charm"
        ],
        "information": "The Son of Wands symbolizes passionate action, adventurous spirit, and charming boldness.",
        "uprightMeaning": "The Son of Wands charges forward full of passion and adventure—bold action, charming energy, and fearless pursuit of desires. This card indicates taking action on passion, adventurous journeys, and charismatic drive. Act boldly but beware of impulsiveness.",
        "reversedMeaning": "Reversed suggests recklessness, scattered energy, or all passion with no follow-through. Haste may cause problems.",
        "loveMeaning": "Passionate pursuit of love, adventurous romance, or charming but potentially unreliable suitor.",
        "careerMeaning": "Bold career moves, passionate professional pursuits, and action-oriented approach to work.",
        "affirmation": "I pursue my passions with bold, directed action."
      },
      "motherOfWands": {
        "name": "Mother of Wands",
        "element": "Fire",
        "keywords": [
          "confidence",
          "determination",
          "vibrant",
          "warmth",
          "independence"
        ],
        "information": "The Mother of Wands embodies confident warmth, vibrant energy, and determined independence.",
        "uprightMeaning": "The Mother of Wands sits confidently with her sunflowers and black cat—vibrant, warm, and self-assured. This card represents confident leadership, determined pursuit of goals, and inspiring others with your passionate energy. Lead with warmth and authenticity.",
        "reversedMeaning": "Reversed may indicate jealousy, domineering behavior, or confidence turning to arrogance. Fire needs proper direction.",
        "loveMeaning": "Confident, passionate partner. Warmth and determination in relationships. Inspiring love through authentic self.",
        "careerMeaning": "Charismatic professional leadership, inspiring others, and confident pursuit of career goals.",
        "affirmation": "I lead with confident warmth and inspire others."
      },
      "fatherOfWands": {
        "name": "Father of Wands",
        "element": "Fire",
        "keywords": [
          "leadership",
          "vision",
          "entrepreneur",
          "boldness",
          "honor"
        ],
        "information": "The Father of Wands symbolizes visionary leadership, entrepreneurial drive, and bold pursuit of goals with honor.",
        "uprightMeaning": "The Father of Wands commands from his throne with salamander cape and wand—visionary leader, bold entrepreneur, and honorable pursuer of goals. This card represents mastery of fire energy: passionate leadership that inspires others while maintaining integrity.",
        "reversedMeaning": "Reversed indicates tyrannical leadership, ruthless ambition, or burning out. Fire without wisdom destroys.",
        "loveMeaning": "Passionate, visionary partner. Bold leadership in relationships. Beware of domination when reversed.",
        "careerMeaning": "Entrepreneurial success, visionary professional leadership, and bold pursuit of career vision.",
        "affirmation": "I lead with vision, passion, and honor."
      }
    }
  }
}
